-----------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Dat
> asets\nepal_nutri_check.log
  log type:  text
 opened on:  12 Jul 2020, 22:32:25

. 
. *Log file: please search on google the official ISO country code for 
> the country you are analysing and use this three digits to identify t
> he documents and datasets this dofile creates
. *Please look at the front page of the report
. 
. /*
> cd "$workingfolder_in"
> dir
> 
> foreach j in bh ch hh hl wm{
> usespss "`j'.sav", clear 
> save `j'.dta, replace
> }
> */
. * Step 1: Data preparation ******************************************
> ********************************
. ******** Selecting main variables from WM and CH recode and merging w
> ith HL recode  ***********************
. *** Step 1.1 CH – Children’s Level (Children under 5)   *************
> ************************
. *********************************************************************
> *******************
. use "$workingfolder_in\ch.dta", clear //Change to the corresponding C
> H-file//

. 
. ************************************
. *** Step 1.1a Key variable for merging
. ************************************
. *I convert the variable names to lower caps to save time 
. rename _all, lower

. *** Generate individual unique key variable required for data merging
. *** hh1= cluster number; hh2 = household number; ln = child's line nu
> mber in household
. gen double ind_id = hh1*100000 + hh2*100 + ln //Please check length o
> f variables for a correct generation of the id variable//

. format ind_id %20.0g

. label var ind_id "Individual ID"

. 
. duplicates report ind_id

Duplicates in terms of ind_id

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |         5663             0
--------------------------------------

. duplicates tag ind_id, gen(duplicates)

Duplicates in terms of ind_id

. tab ln if duplicates!=0 //A number of children are not listed in the 
> household//
no observations

. *** For Children not listed in the household we create a false househ
> old line to check at merging stage
. bys ind_id: gen line = (_n)

. replace ind_id =  hh1*100000 + hh2*190 + line if duplicate!=0 //We as
> sume consecutive hh line starting at 90//
(0 real changes made)

. 
. duplicates report ind_id //We should not have any duplicate at this s
> tage//

Duplicates in terms of ind_id

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |         5663             0
--------------------------------------

. 
. gen child_CH = 1 //Identification variable for observations in CH rec
> ode//

. 
. *******************************
. *** Step 1.1b Children Nutrition
. *******************************
. //NOTE: Not all MICS surveys have information about children nutritio
> n. If this is the case, please skip this section until step 1.1c "Rep
> lacement of missing for nutrition"//
. 
. *** For this part of the do-file we use the WHO Anthro and macros to 
> calculate the z-scores of the children’s 
. *** nutritional variables (source: http://www.who.int/childgrowth/sof
> tware/en/).
. *** Please follow the instructions:
. *** 1) Unzip the file "igrowup_stata.zip" 
. *** 2) Save the .ado files in "C:\ado\plus\a\"
. *** 3) Save the dta files of the "igrowup_stata" folder into the dire
> ctory that you want to use 
. *** as "Directory of reference tables", we recommend the following: "
> C:\igrowup_stata"
. 
. *** Following, we indicate to the Stata compiler where the igrowup_re
> stricted.ado file is stored 
. *** using the following command:
. 
. adopath + "$path_ado/igrowup_stata"
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\oldig\OneDrive - Nexus365\igrowup\/igrowup
> _stata"

. 
. *** We will now proceed to create three nutritional variables: 
.         *** weight-for-age (underweight),  
.         *** weight-for-height (wasting) 
.         *** height-for-age (stunting)
. 
. /* We use 'reflib' to specify the package directory where the .dta fi
> les 
> containing the WHO Child Growth Standards are stored.*/ 
. gen str100 reflib = "$path_ado/igrowup_stata"

. lab var reflib "Directory of reference tables"

. 
. /* We use datalib to specify the working directory where the input ST
> ATA 
> dataset containing the anthropometric measurement is stored. */
. gen str100 datalib = "$workingfolder_out" 

. lab var datalib "Directory for datafiles"

. *datalab: to specify the name that will prefix the output files that 
> will be produced from using this ado file (datalab_z_r_rc and datalab
> _prev_rc)
. gen str30 datalab = "children_nutri_npl" //

. lab var   datalab   "Working file"

. 
. *** We now indicate the variables the WHO ado needs to calculate the 
> z-scores: sex, age, weight, height
. 
. * Variable "Sex"
. tab     hl4, miss //Check the variable for "sex" has "1" for male, "2
> " for female and all missing values are "."//

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |      2,965       52.36       52.36
     Female |      2,698       47.64      100.00
------------+-----------------------------------
      Total |      5,663      100.00

. gen     gender = hl4

. desc gender

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------
gender          double  %10.0g                

. tab     gender

     gender |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,965       52.36       52.36
          2 |      2,698       47.64      100.00
------------+-----------------------------------
      Total |      5,663      100.00

. label define gender 1"male" 2"female", replace

. label values gender gender

. 
. * Variable "Age"
. * The age variable can be expresses it in months or days
. ta cage,m //Check all missing values are "."//

        Age |
   (months) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         25        0.44        0.44
          1 |         73        1.29        1.73
          2 |         92        1.62        3.36
          3 |         84        1.48        4.84
          4 |         88        1.55        6.39
          5 |         90        1.59        7.98
          6 |         83        1.47        9.45
          7 |        101        1.78       11.23
          8 |         89        1.57       12.80
          9 |         96        1.70       14.50
         10 |         78        1.38       15.87
         11 |         80        1.41       17.29
         12 |         71        1.25       18.54
         13 |         73        1.29       19.83
         14 |         94        1.66       21.49
         15 |         98        1.73       23.22
         16 |         68        1.20       24.42
         17 |        107        1.89       26.31
         18 |         87        1.54       27.85
         19 |        109        1.92       29.77
         20 |         86        1.52       31.29
         21 |         86        1.52       32.81
         22 |         79        1.40       34.20
         23 |         71        1.25       35.46
         24 |         85        1.50       36.96
         25 |         78        1.38       38.34
         26 |         97        1.71       40.05
         27 |         90        1.59       41.64
         28 |         79        1.40       43.03
         29 |         86        1.52       44.55
         30 |         88        1.55       46.11
         31 |        100        1.77       47.87
         32 |         92        1.62       49.50
         33 |         86        1.52       51.02
         34 |        106        1.87       52.89
         35 |         75        1.32       54.21
         36 |         72        1.27       55.48
         37 |         99        1.75       57.23
         38 |        100        1.77       59.00
         39 |        100        1.77       60.76
         40 |         89        1.57       62.33
         41 |         99        1.75       64.08
         42 |         91        1.61       65.69
         43 |         86        1.52       67.21
         44 |        112        1.98       69.19
         45 |        105        1.85       71.04
         46 |         89        1.57       72.61
         47 |         81        1.43       74.04
         48 |         87        1.54       75.58
         49 |         86        1.52       77.10
         50 |        106        1.87       78.97
         51 |         90        1.59       80.56
         52 |         98        1.73       82.29
         53 |         90        1.59       83.88
         54 |         91        1.61       85.48
         55 |         89        1.57       87.06
         56 |         90        1.59       88.65
         57 |         87        1.54       90.18
         58 |        112        1.98       92.16
         59 |        130        2.30       94.46
          . |        314        5.54      100.00
------------+-----------------------------------
      Total |      5,663      100.00

. ta caged,m //Check all missing values are "."//

Age in days |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        0.02        0.02
          2 |          7        0.12        0.14
          3 |          2        0.04        0.18
          4 |          3        0.05        0.23
          5 |          1        0.02        0.25
          6 |          2        0.04        0.28
          8 |          1        0.02        0.30
          9 |          1        0.02        0.32
         10 |          2        0.04        0.35
         11 |          1        0.02        0.37
         12 |          3        0.05        0.42
         14 |          3        0.05        0.48
         15 |          1        0.02        0.49
         16 |          2        0.04        0.53
         17 |          3        0.05        0.58
         18 |          1        0.02        0.60
         19 |          3        0.05        0.65
         20 |          1        0.02        0.67
         21 |          1        0.02        0.69
         22 |          4        0.07        0.76
         23 |          3        0.05        0.81
         24 |          3        0.05        0.87
         25 |          3        0.05        0.92
         26 |          4        0.07        0.99
         27 |          3        0.05        1.04
         28 |          2        0.04        1.08
         29 |          4        0.07        1.15
         30 |          3        0.05        1.20
         31 |          2        0.04        1.24
         32 |          2        0.04        1.27
         33 |          3        0.05        1.32
         34 |          2        0.04        1.36
         35 |          2        0.04        1.40
         36 |          3        0.05        1.45
         37 |          1        0.02        1.47
         38 |          3        0.05        1.52
         39 |          1        0.02        1.54
         40 |          1        0.02        1.55
         41 |          3        0.05        1.61
         42 |          1        0.02        1.62
         43 |          3        0.05        1.68
         44 |          2        0.04        1.71
         45 |          5        0.09        1.80
         47 |          4        0.07        1.87
         48 |          1        0.02        1.89
         49 |          2        0.04        1.92
         50 |          4        0.07        2.00
         51 |          2        0.04        2.03
         52 |          2        0.04        2.07
         53 |          2        0.04        2.10
         54 |          4        0.07        2.17
         56 |          2        0.04        2.21
         57 |          1        0.02        2.22
         58 |          2        0.04        2.26
         59 |          2        0.04        2.30
         60 |          6        0.11        2.40
         61 |          2        0.04        2.44
         62 |          5        0.09        2.53
         63 |          3        0.05        2.58
         64 |          6        0.11        2.68
         65 |          6        0.11        2.79
         66 |          4        0.07        2.86
         67 |          2        0.04        2.90
         68 |          4        0.07        2.97
         69 |          4        0.07        3.04
         70 |          4        0.07        3.11
         71 |          4        0.07        3.18
         72 |          2        0.04        3.21
         73 |          4        0.07        3.28
         74 |          2        0.04        3.32
         75 |          1        0.02        3.34
         76 |          1        0.02        3.36
         77 |          2        0.04        3.39
         78 |          1        0.02        3.41
         79 |          3        0.05        3.46
         80 |          2        0.04        3.50
         81 |          4        0.07        3.57
         82 |          5        0.09        3.66
         84 |          4        0.07        3.73
         85 |          2        0.04        3.76
         86 |          1        0.02        3.78
         87 |          4        0.07        3.85
         88 |          6        0.11        3.96
         89 |          8        0.14        4.10
         90 |          3        0.05        4.15
         91 |          3        0.05        4.20
         92 |          3        0.05        4.26
         93 |          3        0.05        4.31
         94 |          5        0.09        4.40
         95 |          2        0.04        4.43
         96 |          2        0.04        4.47
         97 |          2        0.04        4.50
         98 |          2        0.04        4.54
         99 |          2        0.04        4.57
        100 |          1        0.02        4.59
        101 |          3        0.05        4.64
        102 |          2        0.04        4.68
        104 |          2        0.04        4.71
        105 |          6        0.11        4.82
        106 |          5        0.09        4.91
        107 |          1        0.02        4.93
        108 |          3        0.05        4.98
        109 |          3        0.05        5.03
        110 |          4        0.07        5.10
        111 |          1        0.02        5.12
        112 |          3        0.05        5.17
        113 |          3        0.05        5.23
        114 |          3        0.05        5.28
        116 |          4        0.07        5.35
        117 |          1        0.02        5.37
        118 |          2        0.04        5.40
        119 |          5        0.09        5.49
        120 |          2        0.04        5.53
        121 |          4        0.07        5.60
        122 |          2        0.04        5.63
        123 |          2        0.04        5.67
        124 |          4        0.07        5.74
        126 |          3        0.05        5.79
        127 |          2        0.04        5.83
        128 |          3        0.05        5.88
        129 |          2        0.04        5.92
        130 |          1        0.02        5.93
        131 |          4        0.07        6.00
        132 |          2        0.04        6.04
        133 |          2        0.04        6.07
        134 |          3        0.05        6.13
        135 |          4        0.07        6.20
        136 |          1        0.02        6.22
        137 |          4        0.07        6.29
        139 |          4        0.07        6.36
        140 |          5        0.09        6.45
        141 |          2        0.04        6.48
        142 |          5        0.09        6.57
        143 |          4        0.07        6.64
        144 |          4        0.07        6.71
        145 |          3        0.05        6.76
        146 |          4        0.07        6.83
        147 |          3        0.05        6.89
        148 |          5        0.09        6.98
        149 |          4        0.07        7.05
        150 |          2        0.04        7.08
        151 |          3        0.05        7.13
        153 |          1        0.02        7.15
        155 |          5        0.09        7.24
        156 |          5        0.09        7.33
        157 |          4        0.07        7.40
        158 |          1        0.02        7.42
        159 |          4        0.07        7.49
        160 |          4        0.07        7.56
        161 |          1        0.02        7.58
        162 |          5        0.09        7.66
        163 |          3        0.05        7.72
        164 |          3        0.05        7.77
        166 |          2        0.04        7.81
        167 |          2        0.04        7.84
        168 |          1        0.02        7.86
        169 |          7        0.12        7.98
        170 |          5        0.09        8.07
        171 |          4        0.07        8.14
        172 |          2        0.04        8.18
        173 |          3        0.05        8.23
        174 |          2        0.04        8.26
        175 |          3        0.05        8.32
        176 |          1        0.02        8.33
        177 |          2        0.04        8.37
        178 |          3        0.05        8.42
        180 |          4        0.07        8.49
        181 |          3        0.05        8.55
        182 |          6        0.11        8.65
        183 |          5        0.09        8.74
        184 |          3        0.05        8.79
        185 |          1        0.02        8.81
        186 |          3        0.05        8.86
        187 |          4        0.07        8.94
        188 |          2        0.04        8.97
        189 |          2        0.04        9.01
        190 |          4        0.07        9.08
        191 |          2        0.04        9.11
        193 |          3        0.05        9.16
        194 |          4        0.07        9.24
        195 |          2        0.04        9.27
        196 |          2        0.04        9.31
        197 |          5        0.09        9.39
        198 |          5        0.09        9.48
        199 |          4        0.07        9.55
        200 |          2        0.04        9.59
        201 |          3        0.05        9.64
        202 |          2        0.04        9.68
        203 |          3        0.05        9.73
        205 |          1        0.02        9.75
        207 |          9        0.16        9.91
        208 |          2        0.04        9.94
        209 |          8        0.14       10.08
        210 |          5        0.09       10.17
        211 |          1        0.02       10.19
        212 |          4        0.07       10.26
        213 |          2        0.04       10.29
        214 |          1        0.02       10.31
        215 |          3        0.05       10.37
        216 |          1        0.02       10.38
        217 |          5        0.09       10.47
        218 |          3        0.05       10.52
        219 |          3        0.05       10.58
        220 |          5        0.09       10.67
        221 |          2        0.04       10.70
        222 |          1        0.02       10.72
        223 |          4        0.07       10.79
        224 |          2        0.04       10.82
        225 |          7        0.12       10.95
        226 |          2        0.04       10.98
        227 |          4        0.07       11.05
        228 |          1        0.02       11.07
        229 |          5        0.09       11.16
        230 |          3        0.05       11.21
        231 |          3        0.05       11.27
        232 |          2        0.04       11.30
        233 |          6        0.11       11.41
        234 |          8        0.14       11.55
        235 |          3        0.05       11.60
        236 |          6        0.11       11.71
        237 |          1        0.02       11.73
        238 |          6        0.11       11.83
        239 |          4        0.07       11.90
        241 |          4        0.07       11.97
        242 |          2        0.04       12.01
        243 |          3        0.05       12.06
        244 |          2        0.04       12.10
        245 |          4        0.07       12.17
        246 |          2        0.04       12.20
        247 |          3        0.05       12.25
        248 |          2        0.04       12.29
        249 |          2        0.04       12.33
        250 |          5        0.09       12.41
        251 |          1        0.02       12.43
        252 |          4        0.07       12.50
        253 |          4        0.07       12.57
        254 |          1        0.02       12.59
        255 |          5        0.09       12.68
        256 |          4        0.07       12.75
        258 |          1        0.02       12.77
        259 |          2        0.04       12.80
        260 |          2        0.04       12.84
        261 |          2        0.04       12.87
        262 |          1        0.02       12.89
        263 |          2        0.04       12.93
        264 |          8        0.14       13.07
        265 |          3        0.05       13.12
        266 |          5        0.09       13.21
        267 |          1        0.02       13.23
        268 |          4        0.07       13.30
        269 |          4        0.07       13.37
        270 |          3        0.05       13.42
        271 |          4        0.07       13.49
        272 |          2        0.04       13.53
        273 |          2        0.04       13.56
        274 |          4        0.07       13.63
        275 |          3        0.05       13.69
        276 |          4        0.07       13.76
        277 |          3        0.05       13.81
        278 |          2        0.04       13.84
        279 |          3        0.05       13.90
        280 |          7        0.12       14.02
        281 |          4        0.07       14.09
        282 |          1        0.02       14.11
        284 |          1        0.02       14.13
        285 |          1        0.02       14.14
        286 |          4        0.07       14.22
        287 |          1        0.02       14.23
        288 |          2        0.04       14.27
        289 |          5        0.09       14.36
        290 |          4        0.07       14.43
        291 |          5        0.09       14.52
        292 |          5        0.09       14.60
        293 |          1        0.02       14.62
        294 |          1        0.02       14.64
        295 |          2        0.04       14.67
        296 |          3        0.05       14.73
        297 |          5        0.09       14.82
        298 |          2        0.04       14.85
        299 |          2        0.04       14.89
        300 |          3        0.05       14.94
        301 |          2        0.04       14.97
        302 |          6        0.11       15.08
        303 |          2        0.04       15.12
        305 |          4        0.07       15.19
        307 |          1        0.02       15.20
        308 |          2        0.04       15.24
        309 |          3        0.05       15.29
        310 |          2        0.04       15.33
        311 |          1        0.02       15.35
        312 |          3        0.05       15.40
        313 |          2        0.04       15.43
        314 |          5        0.09       15.52
        315 |          6        0.11       15.63
        316 |          4        0.07       15.70
        317 |          2        0.04       15.73
        318 |          1        0.02       15.75
        319 |          3        0.05       15.80
        320 |          5        0.09       15.89
        321 |          3        0.05       15.95
        322 |          5        0.09       16.03
        323 |          3        0.05       16.09
        324 |          1        0.02       16.10
        325 |          2        0.04       16.14
        326 |          1        0.02       16.16
        327 |          2        0.04       16.19
        328 |          4        0.07       16.26
        329 |          4        0.07       16.33
        331 |          4        0.07       16.40
        332 |          5        0.09       16.49
        333 |          4        0.07       16.56
        334 |          1        0.02       16.58
        335 |          2        0.04       16.62
        336 |          2        0.04       16.65
        337 |          3        0.05       16.70
        338 |          3        0.05       16.76
        339 |          3        0.05       16.81
        340 |          2        0.04       16.85
        341 |          3        0.05       16.90
        342 |          2        0.04       16.93
        344 |          2        0.04       16.97
        345 |          5        0.09       17.06
        347 |          1        0.02       17.08
        348 |          2        0.04       17.11
        349 |          1        0.02       17.13
        350 |          1        0.02       17.15
        352 |          1        0.02       17.16
        353 |          5        0.09       17.25
        354 |          3        0.05       17.31
        355 |          4        0.07       17.38
        356 |          1        0.02       17.39
        357 |          3        0.05       17.45
        359 |          1        0.02       17.46
        360 |          2        0.04       17.50
        361 |          2        0.04       17.53
        362 |          1        0.02       17.55
        363 |          1        0.02       17.57
        364 |          2        0.04       17.61
        365 |          6        0.11       17.71
        366 |          6        0.11       17.82
        368 |          7        0.12       17.94
        369 |          1        0.02       17.96
        370 |          7        0.12       18.08
        371 |          1        0.02       18.10
        372 |          3        0.05       18.15
        373 |          6        0.11       18.26
        374 |          3        0.05       18.31
        375 |          1        0.02       18.33
        376 |          2        0.04       18.36
        377 |          2        0.04       18.40
        378 |          1        0.02       18.42
        380 |          1        0.02       18.44
        381 |          1        0.02       18.45
        382 |          3        0.05       18.51
        383 |          3        0.05       18.56
        385 |          3        0.05       18.61
        386 |          2        0.04       18.65
        387 |          3        0.05       18.70
        388 |          6        0.11       18.81
        389 |          5        0.09       18.89
        390 |          2        0.04       18.93
        391 |          1        0.02       18.95
        392 |          2        0.04       18.98
        393 |          3        0.05       19.04
        394 |          3        0.05       19.09
        395 |          3        0.05       19.14
        396 |          2        0.04       19.18
        397 |          3        0.05       19.23
        398 |          3        0.05       19.28
        399 |          4        0.07       19.35
        401 |          6        0.11       19.46
        402 |          1        0.02       19.48
        403 |          3        0.05       19.53
        404 |          2        0.04       19.57
        405 |          2        0.04       19.60
        406 |          2        0.04       19.64
        409 |          1        0.02       19.65
        411 |          3        0.05       19.71
        412 |          5        0.09       19.80
        413 |          1        0.02       19.81
        414 |          3        0.05       19.87
        415 |          3        0.05       19.92
        417 |          3        0.05       19.97
        418 |          4        0.07       20.04
        419 |          3        0.05       20.10
        420 |          7        0.12       20.22
        421 |          2        0.04       20.25
        422 |          5        0.09       20.34
        423 |          9        0.16       20.50
        424 |          6        0.11       20.61
        425 |          2        0.04       20.64
        426 |          4        0.07       20.71
        427 |          2        0.04       20.75
        428 |          4        0.07       20.82
        429 |          4        0.07       20.89
        430 |          5        0.09       20.98
        431 |          3        0.05       21.03
        432 |          3        0.05       21.08
        433 |          1        0.02       21.10
        434 |          5        0.09       21.19
        435 |          3        0.05       21.24
        436 |          1        0.02       21.26
        437 |          4        0.07       21.33
        438 |          2        0.04       21.37
        439 |          5        0.09       21.46
        440 |          1        0.02       21.47
        441 |          2        0.04       21.51
        442 |          4        0.07       21.58
        443 |          2        0.04       21.61
        444 |          2        0.04       21.65
        445 |          4        0.07       21.72
        446 |          1        0.02       21.74
        447 |          7        0.12       21.86
        448 |          1        0.02       21.88
        449 |          3        0.05       21.93
        450 |          3        0.05       21.98
        451 |          4        0.07       22.06
        452 |          4        0.07       22.13
        453 |          5        0.09       22.21
        454 |          3        0.05       22.27
        457 |          4        0.07       22.34
        458 |          2        0.04       22.37
        459 |          2        0.04       22.41
        460 |          4        0.07       22.48
        461 |          4        0.07       22.55
        462 |          8        0.14       22.69
        463 |          1        0.02       22.71
        464 |          5        0.09       22.80
        465 |          5        0.09       22.89
        466 |          3        0.05       22.94
        467 |          4        0.07       23.01
        468 |          3        0.05       23.06
        469 |          4        0.07       23.13
        470 |          3        0.05       23.19
        471 |          1        0.02       23.20
        473 |          1        0.02       23.22
        474 |          3        0.05       23.27
        475 |          1        0.02       23.29
        476 |          1        0.02       23.31
        477 |          1        0.02       23.33
        478 |          4        0.07       23.40
        479 |          2        0.04       23.43
        480 |          2        0.04       23.47
        481 |          3        0.05       23.52
        482 |          1        0.02       23.54
        483 |          1        0.02       23.56
        484 |          1        0.02       23.57
        485 |          4        0.07       23.64
        486 |          1        0.02       23.66
        488 |          2        0.04       23.70
        489 |          2        0.04       23.73
        490 |          5        0.09       23.82
        491 |          2        0.04       23.86
        492 |          3        0.05       23.91
        493 |          2        0.04       23.94
        494 |          2        0.04       23.98
        495 |          4        0.07       24.05
        496 |          2        0.04       24.09
        497 |          4        0.07       24.16
        498 |          3        0.05       24.21
        499 |          2        0.04       24.25
        500 |          6        0.11       24.35
        501 |          3        0.05       24.40
        502 |          4        0.07       24.47
        504 |          3        0.05       24.53
        505 |          2        0.04       24.56
        506 |          4        0.07       24.63
        507 |          1        0.02       24.65
        508 |          8        0.14       24.79
        509 |          4        0.07       24.86
        510 |          3        0.05       24.92
        511 |          2        0.04       24.95
        512 |          2        0.04       24.99
        513 |          6        0.11       25.09
        514 |          2        0.04       25.13
        515 |          2        0.04       25.16
        516 |          3        0.05       25.22
        517 |          6        0.11       25.32
        518 |          3        0.05       25.38
        519 |          3        0.05       25.43
        520 |          2        0.04       25.46
        521 |          3        0.05       25.52
        522 |          2        0.04       25.55
        523 |          6        0.11       25.66
        524 |          4        0.07       25.73
        525 |          6        0.11       25.83
        526 |          6        0.11       25.94
        527 |          4        0.07       26.01
        528 |          1        0.02       26.03
        529 |          4        0.07       26.10
        530 |          5        0.09       26.19
        531 |          2        0.04       26.22
        532 |          1        0.02       26.24
        533 |          7        0.12       26.36
        534 |          4        0.07       26.43
        535 |          1        0.02       26.45
        536 |          3        0.05       26.51
        537 |          1        0.02       26.52
        538 |          2        0.04       26.56
        539 |          3        0.05       26.61
        540 |          5        0.09       26.70
        541 |          1        0.02       26.72
        542 |          3        0.05       26.77
        543 |          3        0.05       26.82
        544 |          4        0.07       26.89
        545 |          3        0.05       26.95
        546 |          1        0.02       26.96
        547 |          7        0.12       27.09
        548 |          3        0.05       27.14
        549 |          3        0.05       27.19
        550 |          2        0.04       27.23
        551 |          1        0.02       27.25
        552 |          2        0.04       27.28
        553 |          6        0.11       27.39
        554 |          3        0.05       27.44
        555 |          6        0.11       27.55
        556 |          4        0.07       27.62
        557 |          3        0.05       27.67
        558 |          2        0.04       27.71
        559 |          4        0.07       27.78
        560 |          2        0.04       27.81
        561 |          3        0.05       27.87
        562 |          3        0.05       27.92
        563 |          6        0.11       28.02
        564 |          1        0.02       28.04
        565 |          1        0.02       28.06
        566 |          1        0.02       28.08
        567 |          4        0.07       28.15
        568 |          3        0.05       28.20
        569 |          5        0.09       28.29
        570 |          7        0.12       28.41
        571 |          2        0.04       28.45
        573 |          3        0.05       28.50
        574 |          4        0.07       28.57
        575 |          4        0.07       28.64
        576 |          1        0.02       28.66
        577 |          1        0.02       28.68
        578 |          4        0.07       28.75
        579 |          1        0.02       28.77
        580 |          1        0.02       28.78
        581 |          5        0.09       28.87
        582 |          3        0.05       28.92
        583 |          8        0.14       29.07
        584 |          1        0.02       29.08
        585 |          1        0.02       29.10
        586 |          8        0.14       29.24
        587 |          2        0.04       29.28
        588 |          4        0.07       29.35
        589 |          5        0.09       29.44
        590 |          4        0.07       29.51
        591 |          2        0.04       29.54
        592 |          1        0.02       29.56
        593 |          1        0.02       29.58
        594 |          2        0.04       29.61
        595 |          2        0.04       29.65
        596 |          4        0.07       29.72
        597 |          5        0.09       29.81
        598 |          2        0.04       29.84
        599 |          2        0.04       29.88
        600 |          2        0.04       29.91
        601 |          2        0.04       29.95
        602 |          6        0.11       30.05
        603 |          3        0.05       30.11
        604 |          3        0.05       30.16
        605 |          3        0.05       30.21
        606 |          3        0.05       30.27
        607 |          6        0.11       30.37
        608 |          4        0.07       30.44
        609 |          2        0.04       30.48
        610 |          2        0.04       30.51
        611 |          4        0.07       30.58
        612 |          2        0.04       30.62
        613 |          6        0.11       30.73
        614 |          4        0.07       30.80
        615 |          2        0.04       30.83
        616 |          2        0.04       30.87
        617 |          2        0.04       30.90
        618 |          7        0.12       31.03
        619 |          2        0.04       31.06
        620 |          5        0.09       31.15
        622 |          2        0.04       31.18
        623 |          3        0.05       31.24
        625 |          5        0.09       31.33
        626 |          2        0.04       31.36
        627 |          8        0.14       31.50
        628 |          6        0.11       31.61
        629 |          3        0.05       31.66
        632 |          4        0.07       31.73
        633 |          2        0.04       31.77
        634 |          5        0.09       31.86
        635 |          3        0.05       31.91
        636 |          3        0.05       31.96
        637 |          2        0.04       32.00
        638 |          1        0.02       32.01
        639 |          1        0.02       32.03
        640 |          6        0.11       32.14
        641 |          4        0.07       32.21
        642 |          5        0.09       32.30
        643 |          1        0.02       32.32
        645 |          4        0.07       32.39
        646 |          1        0.02       32.40
        647 |          2        0.04       32.44
        648 |          1        0.02       32.46
        649 |          3        0.05       32.51
        650 |          3        0.05       32.56
        651 |          3        0.05       32.62
        652 |          3        0.05       32.67
        653 |          4        0.07       32.74
        654 |          3        0.05       32.79
        655 |          1        0.02       32.81
        656 |          1        0.02       32.83
        657 |          1        0.02       32.84
        659 |          2        0.04       32.88
        660 |          5        0.09       32.97
        661 |          3        0.05       33.02
        662 |          1        0.02       33.04
        663 |          4        0.07       33.11
        664 |          3        0.05       33.16
        665 |          2        0.04       33.20
        666 |          4        0.07       33.27
        667 |          3        0.05       33.32
        669 |          2        0.04       33.36
        670 |          4        0.07       33.43
        671 |          2        0.04       33.46
        672 |          4        0.07       33.53
        673 |          1        0.02       33.55
        674 |          5        0.09       33.64
        675 |          4        0.07       33.71
        676 |          3        0.05       33.76
        677 |          3        0.05       33.82
        678 |          2        0.04       33.85
        679 |          3        0.05       33.90
        680 |          4        0.07       33.97
        681 |          1        0.02       33.99
        682 |          2        0.04       34.03
        683 |          1        0.02       34.05
        684 |          5        0.09       34.13
        686 |          4        0.07       34.20
        687 |          3        0.05       34.26
        688 |          6        0.11       34.36
        689 |          2        0.04       34.40
        690 |          3        0.05       34.45
        691 |          4        0.07       34.52
        692 |          3        0.05       34.58
        693 |          1        0.02       34.59
        694 |          3        0.05       34.65
        695 |          4        0.07       34.72
        696 |          1        0.02       34.73
        697 |          3        0.05       34.79
        698 |          1        0.02       34.80
        699 |          2        0.04       34.84
        701 |          3        0.05       34.89
        702 |          3        0.05       34.95
        703 |          1        0.02       34.96
        704 |          5        0.09       35.05
        705 |          1        0.02       35.07
        706 |          3        0.05       35.12
        707 |          1        0.02       35.14
        708 |          1        0.02       35.16
        709 |          4        0.07       35.23
        710 |          4        0.07       35.30
        711 |          5        0.09       35.39
        712 |          2        0.04       35.42
        713 |          1        0.02       35.44
        714 |          1        0.02       35.46
        715 |          1        0.02       35.48
        716 |          3        0.05       35.53
        717 |          2        0.04       35.56
        718 |          3        0.05       35.62
        719 |          1        0.02       35.63
        720 |          3        0.05       35.69
        721 |          4        0.07       35.76
        722 |          1        0.02       35.78
        723 |          2        0.04       35.81
        724 |          4        0.07       35.88
        725 |          1        0.02       35.90
        727 |          2        0.04       35.94
        728 |          1        0.02       35.95
        729 |          3        0.05       36.01
        730 |          5        0.09       36.09
        731 |          3        0.05       36.15
        732 |          2        0.04       36.18
        733 |          4        0.07       36.25
        735 |          7        0.12       36.38
        737 |          3        0.05       36.43
        738 |          2        0.04       36.46
        739 |          5        0.09       36.55
        740 |          3        0.05       36.61
        741 |          3        0.05       36.66
        742 |          3        0.05       36.71
        743 |          4        0.07       36.78
        744 |          5        0.09       36.87
        745 |          3        0.05       36.92
        746 |          4        0.07       36.99
        747 |          1        0.02       37.01
        750 |          3        0.05       37.07
        751 |          4        0.07       37.14
        752 |          3        0.05       37.19
        754 |          2        0.04       37.22
        756 |          3        0.05       37.28
        757 |          5        0.09       37.37
        758 |          3        0.05       37.42
        759 |          1        0.02       37.44
        760 |          3        0.05       37.49
        761 |          2        0.04       37.52
        762 |          2        0.04       37.56
        763 |          4        0.07       37.63
        764 |          2        0.04       37.67
        765 |          1        0.02       37.68
        766 |          1        0.02       37.70
        767 |          5        0.09       37.79
        768 |          6        0.11       37.90
        769 |          4        0.07       37.97
        771 |          3        0.05       38.02
        772 |          4        0.07       38.09
        773 |          4        0.07       38.16
        774 |          3        0.05       38.21
        775 |          2        0.04       38.25
        776 |          1        0.02       38.27
        777 |          7        0.12       38.39
        778 |          3        0.05       38.44
        779 |          3        0.05       38.50
        780 |          5        0.09       38.58
        781 |          2        0.04       38.62
        782 |          3        0.05       38.67
        783 |          3        0.05       38.73
        785 |          7        0.12       38.85
        786 |          3        0.05       38.90
        787 |          3        0.05       38.95
        788 |          2        0.04       38.99
        789 |          1        0.02       39.01
        790 |          3        0.05       39.06
        791 |          4        0.07       39.13
        792 |          2        0.04       39.17
        793 |          3        0.05       39.22
        794 |          5        0.09       39.31
        795 |          1        0.02       39.33
        796 |          3        0.05       39.38
        797 |          2        0.04       39.41
        798 |          6        0.11       39.52
        799 |          1        0.02       39.54
        800 |          2        0.04       39.57
        801 |          1        0.02       39.59
        802 |          5        0.09       39.68
        803 |          3        0.05       39.73
        804 |          4        0.07       39.80
        805 |          2        0.04       39.84
        806 |          1        0.02       39.86
        807 |          2        0.04       39.89
        808 |          1        0.02       39.91
        809 |          5        0.09       40.00
        810 |          5        0.09       40.08
        811 |          2        0.04       40.12
        812 |          2        0.04       40.16
        813 |          4        0.07       40.23
        814 |          2        0.04       40.26
        815 |          3        0.05       40.31
        816 |          5        0.09       40.40
        817 |          1        0.02       40.42
        819 |          7        0.12       40.54
        820 |          4        0.07       40.61
        821 |          3        0.05       40.67
        822 |          3        0.05       40.72
        823 |          3        0.05       40.77
        824 |          3        0.05       40.83
        825 |          3        0.05       40.88
        826 |          4        0.07       40.95
        827 |          3        0.05       41.00
        828 |          5        0.09       41.09
        829 |          3        0.05       41.14
        830 |          1        0.02       41.16
        831 |          3        0.05       41.21
        832 |          4        0.07       41.29
        833 |          3        0.05       41.34
        834 |          2        0.04       41.37
        835 |          4        0.07       41.44
        836 |          5        0.09       41.53
        837 |          2        0.04       41.57
        838 |          2        0.04       41.60
        839 |          1        0.02       41.62
        840 |          1        0.02       41.64
        841 |          1        0.02       41.66
        842 |          3        0.05       41.71
        843 |          5        0.09       41.80
        844 |          2        0.04       41.83
        845 |          4        0.07       41.90
        846 |          1        0.02       41.92
        847 |          7        0.12       42.04
        848 |          1        0.02       42.06
        849 |          1        0.02       42.08
        850 |          4        0.07       42.15
        851 |          4        0.07       42.22
        852 |          2        0.04       42.26
        853 |          4        0.07       42.33
        855 |          3        0.05       42.38
        856 |          5        0.09       42.47
        857 |          2        0.04       42.50
        858 |          2        0.04       42.54
        859 |          2        0.04       42.57
        860 |          1        0.02       42.59
        861 |          4        0.07       42.66
        862 |          5        0.09       42.75
        863 |          3        0.05       42.80
        864 |          1        0.02       42.82
        865 |          3        0.05       42.87
        866 |          2        0.04       42.91
        867 |          4        0.07       42.98
        868 |          2        0.04       43.02
        869 |          6        0.11       43.12
        870 |          1        0.02       43.14
        871 |          3        0.05       43.19
        872 |          1        0.02       43.21
        873 |          3        0.05       43.26
        874 |          5        0.09       43.35
        875 |          2        0.04       43.39
        876 |          2        0.04       43.42
        877 |          2        0.04       43.46
        878 |          3        0.05       43.51
        879 |          4        0.07       43.58
        880 |          2        0.04       43.62
        881 |          1        0.02       43.63
        882 |          2        0.04       43.67
        883 |          3        0.05       43.72
        884 |          3        0.05       43.78
        887 |          2        0.04       43.81
        888 |          1        0.02       43.83
        889 |          8        0.14       43.97
        890 |          1        0.02       43.99
        891 |          3        0.05       44.04
        892 |          3        0.05       44.09
        893 |          6        0.11       44.20
        894 |          4        0.07       44.27
        895 |          5        0.09       44.36
        898 |          2        0.04       44.39
        899 |          4        0.07       44.46
        900 |          6        0.11       44.57
        901 |          2        0.04       44.61
        902 |          1        0.02       44.62
        903 |          3        0.05       44.68
        904 |          6        0.11       44.78
        905 |          3        0.05       44.83
        906 |          2        0.04       44.87
        907 |          4        0.07       44.94
        908 |          2        0.04       44.98
        909 |          5        0.09       45.06
        910 |          2        0.04       45.10
        911 |          3        0.05       45.15
        912 |          4        0.07       45.22
        913 |          3        0.05       45.28
        914 |         10        0.18       45.45
        915 |          2        0.04       45.49
        916 |          2        0.04       45.52
        917 |          2        0.04       45.56
        918 |          1        0.02       45.58
        919 |          3        0.05       45.63
        920 |          3        0.05       45.68
        921 |          4        0.07       45.75
        922 |          3        0.05       45.81
        923 |          5        0.09       45.89
        924 |          2        0.04       45.93
        925 |          3        0.05       45.98
        926 |          4        0.07       46.05
        927 |          2        0.04       46.09
        928 |          4        0.07       46.16
        929 |          2        0.04       46.19
        930 |          3        0.05       46.25
        931 |          2        0.04       46.28
        932 |          2        0.04       46.32
        933 |          3        0.05       46.37
        934 |          4        0.07       46.44
        935 |          4        0.07       46.51
        936 |          3        0.05       46.57
        937 |          2        0.04       46.60
        938 |          1        0.02       46.62
        939 |          6        0.11       46.72
        940 |          2        0.04       46.76
        941 |          2        0.04       46.79
        942 |          2        0.04       46.83
        943 |          3        0.05       46.88
        944 |          7        0.12       47.01
        945 |          2        0.04       47.04
        946 |          3        0.05       47.10
        947 |          3        0.05       47.15
        948 |          2        0.04       47.18
        949 |          2        0.04       47.22
        950 |          5        0.09       47.31
        951 |          2        0.04       47.34
        952 |          5        0.09       47.43
        954 |          2        0.04       47.47
        955 |          8        0.14       47.61
        956 |          5        0.09       47.70
        957 |          1        0.02       47.71
        958 |          5        0.09       47.80
        959 |          6        0.11       47.91
        960 |          1        0.02       47.93
        961 |          2        0.04       47.96
        962 |          2        0.04       48.00
        963 |          4        0.07       48.07
        964 |          2        0.04       48.10
        965 |          4        0.07       48.17
        966 |          4        0.07       48.24
        967 |          2        0.04       48.28
        968 |          4        0.07       48.35
        969 |          3        0.05       48.40
        970 |          3        0.05       48.45
        971 |          6        0.11       48.56
        972 |          1        0.02       48.58
        973 |          2        0.04       48.61
        974 |          1        0.02       48.63
        975 |          2        0.04       48.67
        976 |          2        0.04       48.70
        977 |          3        0.05       48.76
        978 |          2        0.04       48.79
        980 |          3        0.05       48.84
        981 |          5        0.09       48.93
        982 |          1        0.02       48.95
        983 |          6        0.11       49.06
        984 |          2        0.04       49.09
        986 |          3        0.05       49.14
        987 |          3        0.05       49.20
        989 |          6        0.11       49.30
        990 |          2        0.04       49.34
        991 |          1        0.02       49.36
        992 |          1        0.02       49.37
        993 |          5        0.09       49.46
        994 |          6        0.11       49.57
        995 |          2        0.04       49.60
        996 |          6        0.11       49.71
        997 |          1        0.02       49.73
        998 |          3        0.05       49.78
        999 |          2        0.04       49.81
       1000 |          3        0.05       49.87
       1001 |          3        0.05       49.92
       1002 |          7        0.12       50.04
       1003 |          2        0.04       50.08
       1004 |          2        0.04       50.11
       1005 |          3        0.05       50.17
       1006 |          3        0.05       50.22
       1007 |          2        0.04       50.26
       1008 |          3        0.05       50.31
       1009 |          6        0.11       50.41
       1011 |          3        0.05       50.47
       1012 |          3        0.05       50.52
       1013 |          5        0.09       50.61
       1014 |          4        0.07       50.68
       1015 |          4        0.07       50.75
       1016 |          4        0.07       50.82
       1017 |          1        0.02       50.84
       1018 |          2        0.04       50.87
       1019 |          2        0.04       50.91
       1020 |          1        0.02       50.93
       1021 |          5        0.09       51.02
       1022 |          4        0.07       51.09
       1023 |          4        0.07       51.16
       1024 |          1        0.02       51.17
       1025 |          5        0.09       51.26
       1026 |          3        0.05       51.32
       1027 |          4        0.07       51.39
       1028 |          2        0.04       51.42
       1029 |          2        0.04       51.46
       1030 |          4        0.07       51.53
       1031 |          5        0.09       51.62
       1032 |          5        0.09       51.70
       1033 |          5        0.09       51.79
       1034 |          1        0.02       51.81
       1035 |          2        0.04       51.85
       1036 |          5        0.09       51.93
       1037 |          7        0.12       52.06
       1038 |          2        0.04       52.09
       1039 |          4        0.07       52.16
       1040 |          4        0.07       52.23
       1041 |          4        0.07       52.30
       1042 |          3        0.05       52.36
       1043 |          3        0.05       52.41
       1044 |          8        0.14       52.55
       1045 |          2        0.04       52.59
       1046 |          2        0.04       52.62
       1047 |          2        0.04       52.66
       1048 |          4        0.07       52.73
       1049 |          1        0.02       52.75
       1050 |          6        0.11       52.85
       1052 |          4        0.07       52.92
       1053 |          1        0.02       52.94
       1054 |          5        0.09       53.03
       1055 |          1        0.02       53.05
       1056 |          6        0.11       53.15
       1057 |          2        0.04       53.19
       1058 |          5        0.09       53.28
       1059 |          5        0.09       53.36
       1060 |          1        0.02       53.38
       1061 |          2        0.04       53.42
       1062 |          1        0.02       53.43
       1063 |          3        0.05       53.49
       1064 |          2        0.04       53.52
       1065 |          1        0.02       53.54
       1066 |          4        0.07       53.61
       1067 |          1        0.02       53.63
       1068 |          5        0.09       53.72
       1069 |          3        0.05       53.77
       1070 |          2        0.04       53.81
       1071 |          1        0.02       53.82
       1072 |          3        0.05       53.88
       1073 |          3        0.05       53.93
       1074 |          3        0.05       53.98
       1075 |          2        0.04       54.02
       1076 |          2        0.04       54.05
       1077 |          2        0.04       54.09
       1078 |          1        0.02       54.11
       1079 |          2        0.04       54.14
       1081 |          2        0.04       54.18
       1083 |          3        0.05       54.23
       1084 |          2        0.04       54.26
       1085 |          1        0.02       54.28
       1086 |          2        0.04       54.32
       1088 |          2        0.04       54.35
       1089 |          2        0.04       54.39
       1090 |          2        0.04       54.42
       1091 |          1        0.02       54.44
       1092 |          1        0.02       54.46
       1095 |          1        0.02       54.48
       1096 |          2        0.04       54.51
       1097 |          6        0.11       54.62
       1098 |          2        0.04       54.65
       1099 |          3        0.05       54.71
       1100 |          7        0.12       54.83
       1101 |          4        0.07       54.90
       1102 |          3        0.05       54.95
       1103 |          2        0.04       54.99
       1104 |          3        0.05       55.04
       1105 |          4        0.07       55.11
       1106 |          2        0.04       55.15
       1107 |          3        0.05       55.20
       1108 |          3        0.05       55.25
       1109 |          1        0.02       55.27
       1110 |          2        0.04       55.31
       1111 |          4        0.07       55.38
       1112 |          1        0.02       55.39
       1113 |          1        0.02       55.41
       1114 |          3        0.05       55.47
       1115 |          8        0.14       55.61
       1116 |          3        0.05       55.66
       1117 |          1        0.02       55.68
       1118 |          1        0.02       55.69
       1119 |          5        0.09       55.78
       1120 |          1        0.02       55.80
       1121 |          4        0.07       55.87
       1122 |          3        0.05       55.92
       1123 |          1        0.02       55.94
       1124 |          2        0.04       55.98
       1125 |          4        0.07       56.05
       1126 |          5        0.09       56.14
       1127 |          4        0.07       56.21
       1128 |          2        0.04       56.24
       1129 |          2        0.04       56.28
       1130 |          3        0.05       56.33
       1131 |          4        0.07       56.40
       1132 |          5        0.09       56.49
       1133 |          2        0.04       56.52
       1134 |          2        0.04       56.56
       1135 |          6        0.11       56.67
       1136 |          2        0.04       56.70
       1137 |          3        0.05       56.75
       1139 |          3        0.05       56.81
       1140 |          9        0.16       56.97
       1141 |          2        0.04       57.00
       1142 |          2        0.04       57.04
       1143 |          1        0.02       57.05
       1144 |          2        0.04       57.09
       1145 |          3        0.05       57.14
       1146 |          3        0.05       57.20
       1147 |          1        0.02       57.21
       1148 |          3        0.05       57.27
       1149 |          4        0.07       57.34
       1150 |          3        0.05       57.39
       1151 |          4        0.07       57.46
       1152 |          3        0.05       57.51
       1153 |          2        0.04       57.55
       1154 |          6        0.11       57.65
       1155 |          4        0.07       57.73
       1156 |          2        0.04       57.76
       1157 |          6        0.11       57.87
       1158 |          3        0.05       57.92
       1159 |          6        0.11       58.03
       1160 |          1        0.02       58.04
       1161 |          4        0.07       58.11
       1162 |          1        0.02       58.13
       1163 |          2        0.04       58.17
       1164 |          5        0.09       58.26
       1165 |          2        0.04       58.29
       1166 |          2        0.04       58.33
       1167 |          5        0.09       58.41
       1168 |          2        0.04       58.45
       1169 |          5        0.09       58.54
       1170 |          6        0.11       58.64
       1171 |          5        0.09       58.73
       1172 |          2        0.04       58.77
       1173 |          7        0.12       58.89
       1174 |          5        0.09       58.98
       1175 |          4        0.07       59.05
       1176 |          3        0.05       59.10
       1177 |          2        0.04       59.14
       1178 |          6        0.11       59.24
       1179 |          1        0.02       59.26
       1180 |          1        0.02       59.28
       1181 |          1        0.02       59.30
       1182 |          6        0.11       59.40
       1183 |          5        0.09       59.49
       1184 |          3        0.05       59.54
       1185 |          3        0.05       59.60
       1186 |          3        0.05       59.65
       1187 |          7        0.12       59.77
       1188 |          2        0.04       59.81
       1189 |          2        0.04       59.84
       1190 |          2        0.04       59.88
       1191 |          2        0.04       59.92
       1192 |          5        0.09       60.00
       1193 |          2        0.04       60.04
       1194 |          1        0.02       60.06
       1195 |          4        0.07       60.13
       1196 |          3        0.05       60.18
       1197 |          5        0.09       60.27
       1199 |          3        0.05       60.32
       1200 |          2        0.04       60.36
       1201 |          5        0.09       60.44
       1202 |          3        0.05       60.50
       1203 |          1        0.02       60.52
       1204 |          6        0.11       60.62
       1205 |          2        0.04       60.66
       1206 |          2        0.04       60.69
       1207 |          4        0.07       60.76
       1208 |          1        0.02       60.78
       1209 |          5        0.09       60.87
       1210 |          2        0.04       60.90
       1211 |          9        0.16       61.06
       1212 |          4        0.07       61.13
       1213 |          2        0.04       61.17
       1214 |          4        0.07       61.24
       1215 |          5        0.09       61.33
       1216 |          6        0.11       61.43
       1217 |          4        0.07       61.50
       1218 |          4        0.07       61.58
       1219 |          2        0.04       61.61
       1220 |          2        0.04       61.65
       1221 |          3        0.05       61.70
       1222 |          2        0.04       61.73
       1223 |          6        0.11       61.84
       1224 |          2        0.04       61.88
       1225 |          3        0.05       61.93
       1226 |          1        0.02       61.95
       1227 |          3        0.05       62.00
       1228 |          1        0.02       62.02
       1230 |          3        0.05       62.07
       1231 |          1        0.02       62.09
       1232 |          4        0.07       62.16
       1233 |          2        0.04       62.19
       1234 |          1        0.02       62.21
       1235 |          3        0.05       62.26
       1236 |          3        0.05       62.32
       1237 |          1        0.02       62.33
       1238 |          3        0.05       62.39
       1239 |          5        0.09       62.48
       1240 |          4        0.07       62.55
       1241 |          1        0.02       62.56
       1242 |          4        0.07       62.63
       1243 |          3        0.05       62.69
       1244 |          1        0.02       62.71
       1245 |          3        0.05       62.76
       1246 |          3        0.05       62.81
       1247 |          3        0.05       62.86
       1248 |          2        0.04       62.90
       1249 |          5        0.09       62.99
       1250 |          4        0.07       63.06
       1251 |          3        0.05       63.11
       1252 |          4        0.07       63.18
       1253 |          1        0.02       63.20
       1254 |          1        0.02       63.22
       1255 |          2        0.04       63.25
       1256 |          6        0.11       63.36
       1257 |          3        0.05       63.41
       1258 |          6        0.11       63.52
       1259 |          2        0.04       63.55
       1260 |          3        0.05       63.61
       1261 |          3        0.05       63.66
       1262 |          3        0.05       63.71
       1263 |          4        0.07       63.78
       1264 |          1        0.02       63.80
       1265 |          4        0.07       63.87
       1266 |          3        0.05       63.92
       1267 |          1        0.02       63.94
       1268 |          1        0.02       63.96
       1269 |          5        0.09       64.05
       1270 |          3        0.05       64.10
       1271 |          3        0.05       64.15
       1272 |          3        0.05       64.21
       1273 |          5        0.09       64.29
       1274 |          1        0.02       64.31
       1275 |          2        0.04       64.35
       1276 |          6        0.11       64.45
       1277 |          6        0.11       64.56
       1278 |          1        0.02       64.58
       1279 |          2        0.04       64.61
       1280 |          3        0.05       64.67
       1281 |          3        0.05       64.72
       1282 |          5        0.09       64.81
       1283 |          1        0.02       64.82
       1284 |          5        0.09       64.91
       1285 |          4        0.07       64.98
       1286 |          2        0.04       65.02
       1287 |          4        0.07       65.09
       1288 |          3        0.05       65.14
       1289 |          2        0.04       65.18
       1290 |          3        0.05       65.23
       1291 |          4        0.07       65.30
       1292 |          4        0.07       65.37
       1293 |          6        0.11       65.48
       1294 |          8        0.14       65.62
       1295 |          1        0.02       65.64
       1296 |          4        0.07       65.71
       1297 |          3        0.05       65.76
       1298 |          5        0.09       65.85
       1300 |          3        0.05       65.90
       1301 |          2        0.04       65.94
       1302 |          2        0.04       65.97
       1303 |          3        0.05       66.03
       1304 |          6        0.11       66.13
       1305 |          3        0.05       66.18
       1306 |          1        0.02       66.20
       1307 |          5        0.09       66.29
       1308 |          2        0.04       66.33
       1309 |          4        0.07       66.40
       1310 |          1        0.02       66.41
       1311 |          2        0.04       66.45
       1312 |          1        0.02       66.47
       1313 |          4        0.07       66.54
       1314 |          3        0.05       66.59
       1315 |          2        0.04       66.63
       1316 |          5        0.09       66.71
       1317 |          1        0.02       66.73
       1318 |          1        0.02       66.75
       1319 |          3        0.05       66.80
       1320 |          2        0.04       66.84
       1322 |          6        0.11       66.94
       1323 |          2        0.04       66.98
       1324 |          2        0.04       67.01
       1325 |          5        0.09       67.10
       1326 |          7        0.12       67.23
       1327 |          2        0.04       67.26
       1328 |          7        0.12       67.38
       1329 |          2        0.04       67.42
       1330 |          3        0.05       67.47
       1331 |          3        0.05       67.53
       1332 |          2        0.04       67.56
       1333 |          5        0.09       67.65
       1334 |          5        0.09       67.74
       1335 |          2        0.04       67.77
       1336 |          3        0.05       67.83
       1337 |          3        0.05       67.88
       1338 |          5        0.09       67.97
       1339 |          6        0.11       68.07
       1340 |          4        0.07       68.14
       1341 |          4        0.07       68.21
       1342 |          4        0.07       68.29
       1343 |          4        0.07       68.36
       1344 |          5        0.09       68.44
       1345 |          2        0.04       68.48
       1346 |          3        0.05       68.53
       1347 |          3        0.05       68.59
       1348 |          3        0.05       68.64
       1349 |          3        0.05       68.69
       1350 |          3        0.05       68.74
       1351 |          3        0.05       68.80
       1352 |          1        0.02       68.82
       1353 |          4        0.07       68.89
       1354 |          3        0.05       68.94
       1355 |          5        0.09       69.03
       1356 |          7        0.12       69.15
       1357 |          3        0.05       69.20
       1358 |          5        0.09       69.29
       1359 |          5        0.09       69.38
       1360 |          3        0.05       69.43
       1362 |          6        0.11       69.54
       1363 |          7        0.12       69.66
       1364 |          1        0.02       69.68
       1365 |          1        0.02       69.70
       1366 |          5        0.09       69.79
       1367 |          5        0.09       69.87
       1368 |          2        0.04       69.91
       1369 |          7        0.12       70.03
       1370 |          5        0.09       70.12
       1371 |          3        0.05       70.17
       1372 |          3        0.05       70.23
       1373 |          1        0.02       70.25
       1374 |          1        0.02       70.26
       1375 |          2        0.04       70.30
       1376 |          4        0.07       70.37
       1377 |          2        0.04       70.40
       1378 |          2        0.04       70.44
       1379 |          5        0.09       70.53
       1380 |          2        0.04       70.56
       1381 |          5        0.09       70.65
       1382 |          5        0.09       70.74
       1383 |          6        0.11       70.85
       1385 |          8        0.14       70.99
       1386 |          9        0.16       71.15
       1387 |          2        0.04       71.18
       1388 |          2        0.04       71.22
       1389 |          3        0.05       71.27
       1390 |          2        0.04       71.30
       1391 |          1        0.02       71.32
       1392 |          1        0.02       71.34
       1393 |          2        0.04       71.38
       1394 |          1        0.02       71.39
       1395 |          7        0.12       71.52
       1396 |          2        0.04       71.55
       1397 |          3        0.05       71.61
       1398 |          4        0.07       71.68
       1399 |          2        0.04       71.71
       1400 |          1        0.02       71.73
       1401 |          4        0.07       71.80
       1402 |          4        0.07       71.87
       1403 |          1        0.02       71.89
       1404 |          2        0.04       71.92
       1405 |          7        0.12       72.05
       1406 |          3        0.05       72.10
       1407 |          2        0.04       72.13
       1408 |          2        0.04       72.17
       1410 |          1        0.02       72.19
       1411 |          4        0.07       72.26
       1413 |          3        0.05       72.31
       1414 |          2        0.04       72.35
       1415 |          3        0.05       72.40
       1416 |          2        0.04       72.44
       1417 |          2        0.04       72.47
       1418 |          5        0.09       72.56
       1419 |          2        0.04       72.59
       1420 |          1        0.02       72.61
       1421 |          3        0.05       72.66
       1423 |          5        0.09       72.75
       1424 |          2        0.04       72.79
       1425 |          4        0.07       72.86
       1426 |          6        0.11       72.96
       1428 |          3        0.05       73.02
       1429 |          2        0.04       73.05
       1430 |          2        0.04       73.09
       1431 |          3        0.05       73.14
       1432 |          1        0.02       73.16
       1433 |          5        0.09       73.25
       1434 |          1        0.02       73.27
       1435 |          5        0.09       73.35
       1436 |          1        0.02       73.37
       1437 |          2        0.04       73.41
       1438 |          4        0.07       73.48
       1439 |          1        0.02       73.49
       1440 |          3        0.05       73.55
       1441 |          7        0.12       73.67
       1442 |          3        0.05       73.72
       1443 |          4        0.07       73.79
       1444 |          2        0.04       73.83
       1445 |          3        0.05       73.88
       1446 |          3        0.05       73.94
       1447 |          1        0.02       73.95
       1448 |          4        0.07       74.02
       1449 |          7        0.12       74.15
       1450 |          7        0.12       74.27
       1451 |          1        0.02       74.29
       1453 |          1        0.02       74.31
       1454 |          1        0.02       74.32
       1455 |          4        0.07       74.40
       1456 |          3        0.05       74.45
       1457 |          2        0.04       74.48
       1458 |          2        0.04       74.52
       1459 |          1        0.02       74.54
       1461 |          3        0.05       74.59
       1462 |          1        0.02       74.61
       1463 |          6        0.11       74.71
       1464 |          2        0.04       74.75
       1465 |          4        0.07       74.82
       1466 |          4        0.07       74.89
       1467 |          3        0.05       74.94
       1468 |          4        0.07       75.01
       1469 |          3        0.05       75.07
       1470 |          2        0.04       75.10
       1471 |          4        0.07       75.17
       1472 |          2        0.04       75.21
       1473 |          2        0.04       75.24
       1475 |          4        0.07       75.31
       1476 |          1        0.02       75.33
       1477 |          3        0.05       75.38
       1478 |          3        0.05       75.44
       1479 |          1        0.02       75.45
       1480 |          4        0.07       75.53
       1481 |          2        0.04       75.56
       1482 |          3        0.05       75.61
       1483 |          3        0.05       75.67
       1484 |          1        0.02       75.68
       1485 |          3        0.05       75.74
       1486 |          3        0.05       75.79
       1487 |          8        0.14       75.93
       1488 |          2        0.04       75.97
       1489 |          3        0.05       76.02
       1490 |          5        0.09       76.11
       1491 |          1        0.02       76.13
       1493 |          2        0.04       76.16
       1494 |          2        0.04       76.20
       1495 |          2        0.04       76.23
       1496 |          2        0.04       76.27
       1497 |          2        0.04       76.30
       1498 |          4        0.07       76.37
       1499 |          2        0.04       76.41
       1500 |          2        0.04       76.44
       1501 |          1        0.02       76.46
       1502 |          5        0.09       76.55
       1503 |          4        0.07       76.62
       1504 |          5        0.09       76.71
       1505 |          1        0.02       76.73
       1506 |          4        0.07       76.80
       1507 |          5        0.09       76.89
       1508 |          2        0.04       76.92
       1509 |          1        0.02       76.94
       1511 |          3        0.05       76.99
       1512 |          2        0.04       77.03
       1513 |          4        0.07       77.10
       1514 |          6        0.11       77.20
       1515 |          1        0.02       77.22
       1516 |          5        0.09       77.31
       1517 |          5        0.09       77.40
       1518 |          7        0.12       77.52
       1519 |          2        0.04       77.56
       1520 |          3        0.05       77.61
       1521 |          3        0.05       77.66
       1522 |          8        0.14       77.80
       1523 |          5        0.09       77.89
       1524 |          2        0.04       77.93
       1525 |          7        0.12       78.05
       1526 |          6        0.11       78.16
       1527 |          4        0.07       78.23
       1528 |          2        0.04       78.26
       1529 |          2        0.04       78.30
       1530 |          2        0.04       78.33
       1531 |         11        0.19       78.53
       1532 |          3        0.05       78.58
       1534 |          4        0.07       78.65
       1535 |          3        0.05       78.70
       1536 |          2        0.04       78.74
       1537 |          1        0.02       78.76
       1538 |          4        0.07       78.83
       1539 |          2        0.04       78.86
       1540 |          3        0.05       78.92
       1541 |          4        0.07       78.99
       1542 |          3        0.05       79.04
       1543 |          3        0.05       79.09
       1544 |          4        0.07       79.16
       1545 |          5        0.09       79.25
       1546 |          3        0.05       79.30
       1547 |          1        0.02       79.32
       1548 |          8        0.14       79.46
       1549 |          3        0.05       79.52
       1550 |          1        0.02       79.53
       1551 |          2        0.04       79.57
       1552 |          4        0.07       79.64
       1553 |          1        0.02       79.66
       1554 |          3        0.05       79.71
       1555 |          4        0.07       79.78
       1556 |          6        0.11       79.89
       1557 |          2        0.04       79.92
       1558 |          2        0.04       79.96
       1560 |          4        0.07       80.03
       1561 |          2        0.04       80.06
       1562 |          4        0.07       80.13
       1563 |          1        0.02       80.15
       1564 |          1        0.02       80.17
       1565 |          9        0.16       80.33
       1566 |          3        0.05       80.38
       1567 |          3        0.05       80.43
       1569 |          2        0.04       80.47
       1570 |          3        0.05       80.52
       1572 |          2        0.04       80.56
       1573 |          3        0.05       80.61
       1574 |          7        0.12       80.73
       1575 |          4        0.07       80.81
       1576 |          2        0.04       80.84
       1577 |          2        0.04       80.88
       1579 |          3        0.05       80.93
       1581 |          2        0.04       80.96
       1582 |          5        0.09       81.05
       1583 |          4        0.07       81.12
       1584 |          4        0.07       81.19
       1585 |          5        0.09       81.28
       1586 |          5        0.09       81.37
       1587 |          4        0.07       81.44
       1588 |          2        0.04       81.48
       1589 |          3        0.05       81.53
       1590 |          4        0.07       81.60
       1591 |          3        0.05       81.65
       1592 |          1        0.02       81.67
       1593 |          3        0.05       81.72
       1594 |          5        0.09       81.81
       1595 |          1        0.02       81.83
       1596 |          2        0.04       81.86
       1597 |          2        0.04       81.90
       1598 |          9        0.16       82.06
       1599 |          7        0.12       82.18
       1600 |          2        0.04       82.22
       1601 |          2        0.04       82.25
       1602 |          6        0.11       82.36
       1603 |          3        0.05       82.41
       1604 |          5        0.09       82.50
       1605 |          1        0.02       82.52
       1606 |          2        0.04       82.55
       1607 |          1        0.02       82.57
       1608 |          2        0.04       82.61
       1609 |          3        0.05       82.66
       1612 |          3        0.05       82.71
       1613 |          3        0.05       82.77
       1614 |          3        0.05       82.82
       1615 |          6        0.11       82.92
       1616 |          5        0.09       83.01
       1617 |          6        0.11       83.12
       1618 |          1        0.02       83.14
       1619 |          5        0.09       83.22
       1620 |          4        0.07       83.30
       1621 |          3        0.05       83.35
       1622 |          3        0.05       83.40
       1623 |          4        0.07       83.47
       1624 |          3        0.05       83.52
       1625 |          1        0.02       83.54
       1627 |          3        0.05       83.60
       1628 |          4        0.07       83.67
       1629 |          7        0.12       83.79
       1630 |          5        0.09       83.88
       1631 |          2        0.04       83.91
       1632 |          1        0.02       83.93
       1633 |          6        0.11       84.04
       1634 |          3        0.05       84.09
       1635 |          2        0.04       84.13
       1636 |          2        0.04       84.16
       1637 |          1        0.02       84.18
       1638 |          5        0.09       84.27
       1639 |          4        0.07       84.34
       1640 |          3        0.05       84.39
       1641 |          5        0.09       84.48
       1642 |          2        0.04       84.51
       1643 |          6        0.11       84.62
       1645 |          3        0.05       84.67
       1647 |          4        0.07       84.74
       1648 |          3        0.05       84.80
       1649 |          2        0.04       84.83
       1650 |          5        0.09       84.92
       1652 |          2        0.04       84.95
       1654 |          5        0.09       85.04
       1655 |          3        0.05       85.10
       1656 |          3        0.05       85.15
       1657 |          2        0.04       85.18
       1658 |          1        0.02       85.20
       1659 |          2        0.04       85.24
       1660 |          3        0.05       85.29
       1661 |          1        0.02       85.31
       1662 |          1        0.02       85.33
       1663 |          4        0.07       85.40
       1664 |          1        0.02       85.41
       1665 |          3        0.05       85.47
       1666 |          3        0.05       85.52
       1667 |          3        0.05       85.57
       1668 |          4        0.07       85.64
       1669 |          4        0.07       85.71
       1670 |          3        0.05       85.77
       1671 |          2        0.04       85.80
       1672 |          2        0.04       85.84
       1674 |          4        0.07       85.91
       1675 |          3        0.05       85.96
       1677 |          3        0.05       86.01
       1678 |          3        0.05       86.07
       1679 |          5        0.09       86.16
       1680 |          3        0.05       86.21
       1681 |          7        0.12       86.33
       1682 |          3        0.05       86.39
       1683 |          3        0.05       86.44
       1684 |          3        0.05       86.49
       1685 |          4        0.07       86.56
       1686 |          4        0.07       86.63
       1687 |          5        0.09       86.72
       1689 |          7        0.12       86.84
       1690 |          2        0.04       86.88
       1691 |          5        0.09       86.97
       1692 |          3        0.05       87.02
       1693 |          4        0.07       87.09
       1695 |          3        0.05       87.14
       1697 |          1        0.02       87.16
       1698 |          4        0.07       87.23
       1699 |          7        0.12       87.36
       1700 |          3        0.05       87.41
       1701 |          1        0.02       87.43
       1702 |          5        0.09       87.52
       1703 |          3        0.05       87.57
       1704 |          2        0.04       87.60
       1705 |          3        0.05       87.66
       1706 |          3        0.05       87.71
       1707 |          3        0.05       87.76
       1708 |          4        0.07       87.83
       1709 |          1        0.02       87.85
       1711 |          4        0.07       87.92
       1712 |          2        0.04       87.96
       1713 |          2        0.04       87.99
       1714 |          3        0.05       88.05
       1715 |          5        0.09       88.13
       1716 |          4        0.07       88.20
       1717 |          3        0.05       88.26
       1718 |          2        0.04       88.29
       1719 |          2        0.04       88.33
       1720 |          4        0.07       88.40
       1721 |          1        0.02       88.42
       1722 |          3        0.05       88.47
       1723 |          1        0.02       88.49
       1724 |          5        0.09       88.57
       1725 |          2        0.04       88.61
       1726 |          4        0.07       88.68
       1727 |          2        0.04       88.72
       1728 |          5        0.09       88.80
       1729 |          3        0.05       88.86
       1730 |          3        0.05       88.91
       1731 |          2        0.04       88.95
       1732 |          2        0.04       88.98
       1733 |          4        0.07       89.05
       1734 |          1        0.02       89.07
       1735 |          4        0.07       89.14
       1736 |          2        0.04       89.18
       1737 |          4        0.07       89.25
       1738 |          5        0.09       89.33
       1739 |          2        0.04       89.37
       1740 |          3        0.05       89.42
       1741 |          2        0.04       89.46
       1742 |          1        0.02       89.48
       1743 |          4        0.07       89.55
       1744 |          7        0.12       89.67
       1745 |          4        0.07       89.74
       1746 |          4        0.07       89.81
       1747 |          3        0.05       89.86
       1748 |          2        0.04       89.90
       1749 |          4        0.07       89.97
       1750 |          6        0.11       90.08
       1751 |          1        0.02       90.09
       1752 |          4        0.07       90.16
       1753 |          2        0.04       90.20
       1754 |          4        0.07       90.27
       1755 |          1        0.02       90.29
       1756 |          2        0.04       90.32
       1757 |          1        0.02       90.34
       1758 |          2        0.04       90.38
       1759 |          3        0.05       90.43
       1760 |          2        0.04       90.46
       1761 |          6        0.11       90.57
       1762 |          1        0.02       90.59
       1763 |          3        0.05       90.64
       1764 |          1        0.02       90.66
       1765 |          3        0.05       90.71
       1766 |          7        0.12       90.84
       1767 |          7        0.12       90.96
       1768 |          2        0.04       90.99
       1769 |          6        0.11       91.10
       1770 |          8        0.14       91.24
       1771 |          2        0.04       91.28
       1772 |          5        0.09       91.37
       1773 |          3        0.05       91.42
       1775 |          3        0.05       91.47
       1776 |          3        0.05       91.52
       1777 |          4        0.07       91.59
       1778 |          8        0.14       91.74
       1779 |          4        0.07       91.81
       1780 |          3        0.05       91.86
       1781 |          2        0.04       91.89
       1782 |          3        0.05       91.95
       1783 |          4        0.07       92.02
       1784 |          8        0.14       92.16
       1785 |          5        0.09       92.25
       1786 |          3        0.05       92.30
       1787 |          4        0.07       92.37
       1788 |          2        0.04       92.41
       1789 |          2        0.04       92.44
       1790 |          5        0.09       92.53
       1791 |          4        0.07       92.60
       1792 |          3        0.05       92.65
       1793 |          5        0.09       92.74
       1794 |          4        0.07       92.81
       1795 |          4        0.07       92.88
       1796 |          3        0.05       92.94
       1797 |          2        0.04       92.97
       1798 |          8        0.14       93.11
       1799 |          5        0.09       93.20
       1800 |          4        0.07       93.27
       1801 |          4        0.07       93.34
       1802 |          2        0.04       93.38
       1803 |          2        0.04       93.41
       1804 |          2        0.04       93.45
       1805 |          2        0.04       93.48
       1806 |          3        0.05       93.54
       1807 |          2        0.04       93.57
       1808 |          6        0.11       93.68
       1810 |          3        0.05       93.73
       1811 |          2        0.04       93.77
       1812 |          1        0.02       93.78
       1813 |          4        0.07       93.85
       1815 |          2        0.04       93.89
       1816 |          3        0.05       93.94
       1817 |          2        0.04       93.98
       1818 |          1        0.02       94.00
       1819 |          1        0.02       94.01
       1820 |          3        0.05       94.07
       1821 |          5        0.09       94.16
       1822 |          2        0.04       94.19
       1823 |          2        0.04       94.23
       1824 |          1        0.02       94.24
       1825 |          2        0.04       94.28
          . |        324        5.72      100.00
------------+-----------------------------------
      Total |      5,663      100.00

. codebook cage caged //Check unit of measure – in this case age is mea
> sured in months//

-----------------------------------------------------------------------
cage                                                       Age (months)
-----------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,59]                       units:  1
         unique values:  60                       missing .:  314/5,663

                  mean:     30.65
              std. dev:   17.2401

           percentiles:        10%       25%       50%       75%       
> 90%
                                 6        16        31        45       
>  54

-----------------------------------------------------------------------
caged                                                       Age in days
-----------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,1825]                     units:  1
         unique values:  1,712                    missing .:  324/5,663

                  mean:   933.859
              std. dev:   525.459

           percentiles:        10%       25%       50%       75%       
> 90%
                               198       484       947      1382      1
> 650

. clonevar age_months = cage 
(314 missing values generated)

. clonevar age_days = caged
(324 missing values generated)

. replace age_months = . if cage==99 //No missing data here//
(0 real changes made)

. gen str6 ageunit = "days" //We define the unit of measure, in this ca
> se age is measured in months, otherwise please change to ageunit = "d
> ays"//

. lab var ageunit "Days"

. 
. * Variable "body weight" – it must be in kilograms
. ta an3, miss //Check all missing values are "."// 

    Child's |
     weight |
(kilograms) |      Freq.     Percent        Cum.
------------+-----------------------------------
        1.5 |          2        0.04        0.04
        2.1 |          2        0.04        0.07
        2.4 |          1        0.02        0.09
        2.5 |          3        0.05        0.14
        2.6 |          2        0.04        0.18
        2.7 |          2        0.04        0.21
        2.8 |          6        0.11        0.32
        3.0 |          7        0.12        0.44
        3.1 |         10        0.18        0.62
        3.2 |          4        0.07        0.69
        3.3 |          7        0.12        0.81
        3.4 |          8        0.14        0.95
        3.5 |          8        0.14        1.09
        3.6 |          6        0.11        1.20
        3.7 |          2        0.04        1.24
        3.8 |          9        0.16        1.40
        3.9 |          8        0.14        1.54
        4.0 |         16        0.28        1.82
        4.1 |          9        0.16        1.98
        4.2 |         10        0.18        2.15
        4.3 |         13        0.23        2.38
        4.4 |          7        0.12        2.51
        4.5 |         14        0.25        2.75
        4.6 |         11        0.19        2.95
        4.7 |          6        0.11        3.05
        4.8 |         15        0.26        3.32
        4.9 |         12        0.21        3.53
        5.0 |          4        0.07        3.60
        5.1 |         17        0.30        3.90
        5.2 |         15        0.26        4.17
        5.3 |         15        0.26        4.43
        5.4 |         19        0.34        4.77
        5.5 |         14        0.25        5.02
        5.6 |         16        0.28        5.30
        5.7 |         16        0.28        5.58
        5.8 |         16        0.28        5.86
        5.9 |         22        0.39        6.25
        6.0 |         23        0.41        6.66
        6.1 |         18        0.32        6.98
        6.2 |         30        0.53        7.50
        6.3 |         35        0.62        8.12
        6.4 |         16        0.28        8.41
        6.5 |         25        0.44        8.85
        6.6 |         26        0.46        9.31
        6.7 |         23        0.41        9.71
        6.8 |         32        0.57       10.28
        6.9 |         28        0.49       10.77
        7.0 |         31        0.55       11.32
        7.1 |         30        0.53       11.85
        7.2 |         52        0.92       12.77
        7.3 |         36        0.64       13.40
        7.4 |         37        0.65       14.06
        7.5 |         33        0.58       14.64
        7.6 |         43        0.76       15.40
        7.7 |         45        0.79       16.19
        7.8 |         49        0.87       17.06
        7.9 |         47        0.83       17.89
        8.0 |         44        0.78       18.67
        8.1 |         52        0.92       19.58
        8.2 |         50        0.88       20.47
        8.3 |         44        0.78       21.24
        8.4 |         43        0.76       22.00
        8.5 |         42        0.74       22.74
        8.6 |         46        0.81       23.56
        8.7 |         73        1.29       24.85
        8.8 |         50        0.88       25.73
        8.9 |         54        0.95       26.68
        9.0 |         53        0.94       27.62
        9.1 |         48        0.85       28.47
        9.2 |         73        1.29       29.75
        9.3 |         54        0.95       30.71
        9.4 |         44        0.78       31.49
        9.5 |         62        1.09       32.58
        9.6 |         69        1.22       33.80
        9.7 |         62        1.09       34.89
        9.8 |         53        0.94       35.83
        9.9 |         52        0.92       36.75
       10.0 |         46        0.81       37.56
       10.1 |         66        1.17       38.73
       10.2 |         77        1.36       40.08
       10.3 |         70        1.24       41.32
       10.4 |         64        1.13       42.45
       10.5 |         64        1.13       43.58
       10.6 |         43        0.76       44.34
       10.7 |         53        0.94       45.28
       10.8 |         44        0.78       46.05
       10.9 |         54        0.95       47.01
       11.0 |         50        0.88       47.89
       11.1 |         64        1.13       49.02
       11.2 |         61        1.08       50.10
       11.3 |         64        1.13       51.23
       11.4 |         62        1.09       52.32
       11.5 |         64        1.13       53.45
       11.6 |         68        1.20       54.65
       11.7 |         58        1.02       55.68
       11.8 |         76        1.34       57.02
       11.9 |         68        1.20       58.22
       12.0 |         67        1.18       59.40
       12.1 |         65        1.15       60.55
       12.2 |         63        1.11       61.66
       12.3 |         66        1.17       62.83
       12.4 |         52        0.92       63.75
       12.5 |         69        1.22       64.97
       12.6 |         66        1.17       66.13
       12.7 |         64        1.13       67.26
       12.8 |         75        1.32       68.59
       12.9 |         50        0.88       69.47
       13.0 |         51        0.90       70.37
       13.1 |         54        0.95       71.32
       13.2 |         71        1.25       72.58
       13.3 |         30        0.53       73.11
       13.4 |         51        0.90       74.01
       13.5 |         48        0.85       74.85
       13.6 |         43        0.76       75.61
       13.7 |         35        0.62       76.23
       13.8 |         38        0.67       76.90
       13.9 |         44        0.78       77.68
       14.0 |         41        0.72       78.40
       14.1 |         53        0.94       79.34
       14.2 |         47        0.83       80.17
       14.3 |         37        0.65       80.82
       14.4 |         39        0.69       81.51
       14.5 |         32        0.57       82.08
       14.6 |         38        0.67       82.75
       14.7 |         25        0.44       83.19
       14.8 |         29        0.51       83.70
       14.9 |         38        0.67       84.37
       15.0 |         28        0.49       84.87
       15.1 |         29        0.51       85.38
       15.2 |         22        0.39       85.77
       15.3 |         23        0.41       86.17
       15.4 |         19        0.34       86.51
       15.5 |         11        0.19       86.70
       15.6 |         18        0.32       87.02
       15.7 |         21        0.37       87.39
       15.8 |         19        0.34       87.73
       15.9 |         13        0.23       87.96
       16.0 |         12        0.21       88.17
       16.1 |         14        0.25       88.42
       16.2 |         20        0.35       88.77
       16.3 |         15        0.26       89.03
       16.4 |         13        0.23       89.26
       16.5 |         13        0.23       89.49
       16.6 |         11        0.19       89.69
       16.7 |         12        0.21       89.90
       16.8 |         10        0.18       90.08
       16.9 |         18        0.32       90.39
       17.0 |          6        0.11       90.50
       17.1 |          7        0.12       90.62
       17.2 |          5        0.09       90.71
       17.3 |          8        0.14       90.85
       17.4 |          5        0.09       90.94
       17.5 |          7        0.12       91.06
       17.6 |          7        0.12       91.19
       17.7 |          3        0.05       91.24
       17.8 |          6        0.11       91.35
       17.9 |          4        0.07       91.42
       18.0 |          5        0.09       91.51
       18.1 |          5        0.09       91.59
       18.2 |          9        0.16       91.75
       18.3 |          3        0.05       91.81
       18.5 |          5        0.09       91.89
       18.6 |          7        0.12       92.02
       18.7 |          3        0.05       92.07
       18.8 |          4        0.07       92.14
       18.9 |          2        0.04       92.18
       19.0 |          1        0.02       92.19
       19.1 |          2        0.04       92.23
       19.2 |          2        0.04       92.27
       19.3 |          3        0.05       92.32
       19.4 |          1        0.02       92.34
       19.5 |          2        0.04       92.37
       19.8 |          1        0.02       92.39
       19.9 |          1        0.02       92.41
       20.1 |          1        0.02       92.42
       20.2 |          1        0.02       92.44
       20.3 |          1        0.02       92.46
       20.5 |          1        0.02       92.48
       20.7 |          2        0.04       92.51
       21.2 |          2        0.04       92.55
       21.5 |          2        0.04       92.58
       21.8 |          2        0.04       92.62
       22.0 |          1        0.02       92.64
       22.8 |          2        0.04       92.67
       22.9 |          1        0.02       92.69
       24.9 |          1        0.02       92.71
       29.3 |          1        0.02       92.72
          . |        412        7.28      100.00
------------+-----------------------------------
      Total |      5,663      100.00

. codebook an3 //Check unit of measure – in this case weight is measure
> d in kilograms//

-----------------------------------------------------------------------
an3                                          Child's weight (kilograms)
-----------------------------------------------------------------------

                  type:  numeric (double)
                 label:  AN3, but label does not exist

                 range:  [1.5,29.3]                   units:  .1
         unique values:  187                      missing .:  412/5,663

                  mean:   10.8014
              std. dev:   3.22128

           percentiles:        10%       25%       50%       75%       
> 90%
                               6.6       8.6      10.9        13      1
> 4.8

. clonevar weight = an3 
(412 missing values generated)

. desc weight 

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------
weight          double  %16.1f     AN3        Child's weight
                                                (kilograms)

. replace weight = .  if an3>=99 //All missing values or out of range a
> re replaced as "."//
(0 real changes made)

. tab an2 an3 if an3>=99 | an3==., miss //an2: result of the measuremen
> t//

                      |  Child's
                      |   weight
   Result of height / | (kilograms
    length and weight |     )
          measurement |         . |     Total
----------------------+-----------+----------
    Child not present |        33 |        33 
Child or mother / car |        30 |        30 
                Other |        13 |        13 
         Inconsistent |         1 |         1 
              Missing |        21 |        21 
                    . |       314 |       314 
----------------------+-----------+----------
                Total |       412 |       412 

. summ weight

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |      5,251    10.80145    3.221284        1.5       29.3

. 
. * Variable "height" – it must be in centimetres
. ta an4, miss //Check all missing values are "."// 

    Child's |
  length or |
     height |
(centimetre |
         s) |      Freq.     Percent        Cum.
------------+-----------------------------------
       36.4 |          1        0.02        0.02
       42.0 |          1        0.02        0.04
       43.9 |          1        0.02        0.05
       44.0 |          2        0.04        0.09
       44.3 |          1        0.02        0.11
       44.4 |          1        0.02        0.12
       45.2 |          1        0.02        0.14
       46.0 |          1        0.02        0.16
       46.1 |          1        0.02        0.18
       46.5 |          1        0.02        0.19
       47.5 |          2        0.04        0.23
       48.2 |          1        0.02        0.25
       48.6 |          1        0.02        0.26
       49.1 |          2        0.04        0.30
       49.3 |          1        0.02        0.32
       49.5 |          1        0.02        0.34
       49.6 |          1        0.02        0.35
       49.7 |          1        0.02        0.37
       49.9 |          2        0.04        0.41
       50.0 |          4        0.07        0.48
       50.1 |          1        0.02        0.49
       50.2 |          2        0.04        0.53
       50.3 |          2        0.04        0.57
       50.5 |          2        0.04        0.60
       50.6 |          1        0.02        0.62
       51.0 |          3        0.05        0.67
       51.1 |          2        0.04        0.71
       51.2 |          2        0.04        0.74
       51.3 |          3        0.05        0.79
       51.4 |          2        0.04        0.83
       51.5 |          3        0.05        0.88
       51.7 |          3        0.05        0.94
       51.9 |          4        0.07        1.01
       52.0 |          1        0.02        1.02
       52.1 |          3        0.05        1.08
       52.2 |          6        0.11        1.18
       52.3 |          4        0.07        1.25
       52.4 |          1        0.02        1.27
       52.5 |          1        0.02        1.29
       52.6 |          1        0.02        1.31
       52.7 |          3        0.05        1.36
       52.8 |          1        0.02        1.38
       52.9 |          1        0.02        1.40
       53.0 |          1        0.02        1.41
       53.1 |          3        0.05        1.47
       53.2 |          5        0.09        1.55
       53.3 |          4        0.07        1.62
       53.4 |          3        0.05        1.68
       53.5 |          2        0.04        1.71
       53.6 |          2        0.04        1.75
       53.7 |          5        0.09        1.84
       53.8 |          3        0.05        1.89
       53.9 |          2        0.04        1.92
       54.0 |          3        0.05        1.98
       54.2 |          3        0.05        2.03
       54.3 |          3        0.05        2.08
       54.5 |          1        0.02        2.10
       54.6 |          1        0.02        2.12
       54.7 |          1        0.02        2.14
       54.8 |          3        0.05        2.19
       55.0 |          1        0.02        2.21
       55.1 |          2        0.04        2.24
       55.2 |          3        0.05        2.30
       55.3 |          2        0.04        2.33
       55.4 |          2        0.04        2.37
       55.5 |          1        0.02        2.38
       55.6 |          3        0.05        2.44
       55.7 |          2        0.04        2.47
       55.9 |          5        0.09        2.56
       56.0 |          1        0.02        2.58
       56.1 |          4        0.07        2.65
       56.2 |          5        0.09        2.74
       56.3 |          5        0.09        2.83
       56.4 |          3        0.05        2.88
       56.5 |          1        0.02        2.90
       56.6 |          2        0.04        2.93
       56.7 |          2        0.04        2.97
       56.8 |          6        0.11        3.07
       56.9 |          3        0.05        3.13
       57.0 |          2        0.04        3.16
       57.1 |          1        0.02        3.18
       57.2 |          3        0.05        3.23
       57.3 |          7        0.12        3.36
       57.4 |          3        0.05        3.41
       57.5 |          3        0.05        3.46
       57.6 |          3        0.05        3.51
       57.7 |          1        0.02        3.53
       57.8 |          4        0.07        3.60
       57.9 |          4        0.07        3.67
       58.0 |          2        0.04        3.71
       58.1 |          2        0.04        3.74
       58.2 |          6        0.11        3.85
       58.3 |          4        0.07        3.92
       58.4 |          3        0.05        3.97
       58.5 |          7        0.12        4.10
       58.6 |          2        0.04        4.13
       58.7 |          2        0.04        4.17
       58.8 |          1        0.02        4.19
       58.9 |          6        0.11        4.29
       59.0 |          3        0.05        4.34
       59.1 |          3        0.05        4.40
       59.2 |          4        0.07        4.47
       59.3 |          4        0.07        4.54
       59.4 |          2        0.04        4.57
       59.5 |          3        0.05        4.63
       59.6 |          3        0.05        4.68
       59.7 |          3        0.05        4.73
       59.8 |          5        0.09        4.82
       59.9 |          8        0.14        4.96
       60.0 |          5        0.09        5.05
       60.1 |          3        0.05        5.10
       60.2 |         10        0.18        5.28
       60.3 |          5        0.09        5.37
       60.4 |          2        0.04        5.40
       60.5 |          3        0.05        5.46
       60.6 |          3        0.05        5.51
       60.7 |          4        0.07        5.58
       60.8 |          4        0.07        5.65
       60.9 |          1        0.02        5.67
       61.0 |          2        0.04        5.70
       61.1 |          4        0.07        5.77
       61.2 |          5        0.09        5.86
       61.3 |          5        0.09        5.95
       61.4 |          7        0.12        6.07
       61.5 |          3        0.05        6.13
       61.6 |          4        0.07        6.20
       61.7 |          2        0.04        6.23
       61.8 |          2        0.04        6.27
       61.9 |          3        0.05        6.32
       62.0 |          1        0.02        6.34
       62.1 |          7        0.12        6.46
       62.2 |          5        0.09        6.55
       62.3 |          8        0.14        6.69
       62.4 |          4        0.07        6.76
       62.5 |          3        0.05        6.82
       62.6 |          2        0.04        6.85
       62.7 |          2        0.04        6.89
       62.8 |          4        0.07        6.96
       62.9 |          4        0.07        7.03
       63.0 |          5        0.09        7.12
       63.1 |          7        0.12        7.24
       63.2 |          6        0.11        7.35
       63.3 |          8        0.14        7.49
       63.4 |          6        0.11        7.59
       63.5 |          4        0.07        7.66
       63.6 |          4        0.07        7.73
       63.7 |          6        0.11        7.84
       63.8 |          3        0.05        7.89
       63.9 |          5        0.09        7.98
       64.0 |          7        0.12        8.11
       64.1 |          6        0.11        8.21
       64.2 |         10        0.18        8.39
       64.3 |          6        0.11        8.49
       64.4 |          3        0.05        8.55
       64.5 |          2        0.04        8.58
       64.6 |          6        0.11        8.69
       64.7 |          4        0.07        8.76
       64.8 |          4        0.07        8.83
       64.9 |          2        0.04        8.86
       65.0 |          7        0.12        8.99
       65.1 |          3        0.05        9.04
       65.2 |          6        0.11        9.15
       65.3 |         11        0.19        9.34
       65.4 |          7        0.12        9.46
       65.5 |          3        0.05        9.52
       65.6 |          3        0.05        9.57
       65.7 |          9        0.16        9.73
       65.8 |          5        0.09        9.82
       65.9 |          4        0.07        9.89
       66.0 |          4        0.07        9.96
       66.1 |          6        0.11       10.07
       66.2 |          8        0.14       10.21
       66.3 |         12        0.21       10.42
       66.4 |          8        0.14       10.56
       66.5 |          6        0.11       10.67
       66.6 |          5        0.09       10.75
       66.7 |          5        0.09       10.84
       66.8 |          7        0.12       10.97
       66.9 |          5        0.09       11.05
       67.0 |          8        0.14       11.20
       67.1 |          3        0.05       11.25
       67.2 |         13        0.23       11.48
       67.3 |         11        0.19       11.67
       67.4 |          5        0.09       11.76
       67.5 |          5        0.09       11.85
       67.6 |          6        0.11       11.95
       67.7 |          4        0.07       12.03
       67.8 |          5        0.09       12.11
       67.9 |          5        0.09       12.20
       68.0 |          6        0.11       12.31
       68.1 |          3        0.05       12.36
       68.2 |         13        0.23       12.59
       68.3 |          8        0.14       12.73
       68.4 |         13        0.23       12.96
       68.5 |          6        0.11       13.07
       68.6 |          6        0.11       13.17
       68.7 |          8        0.14       13.31
       68.8 |          4        0.07       13.39
       68.9 |          8        0.14       13.53
       69.0 |         11        0.19       13.72
       69.1 |         14        0.25       13.97
       69.2 |         14        0.25       14.22
       69.3 |         14        0.25       14.46
       69.4 |         10        0.18       14.64
       69.5 |          5        0.09       14.73
       69.6 |          8        0.14       14.87
       69.7 |          9        0.16       15.03
       69.8 |          8        0.14       15.17
       69.9 |          9        0.16       15.33
       70.0 |         13        0.23       15.56
       70.1 |         11        0.19       15.75
       70.2 |         14        0.25       16.00
       70.3 |          9        0.16       16.16
       70.4 |          7        0.12       16.28
       70.5 |          9        0.16       16.44
       70.6 |         12        0.21       16.65
       70.7 |          3        0.05       16.70
       70.8 |         12        0.21       16.92
       70.9 |         10        0.18       17.09
       71.0 |          6        0.11       17.20
       71.1 |          9        0.16       17.36
       71.2 |         13        0.23       17.59
       71.3 |         10        0.18       17.76
       71.4 |          5        0.09       17.85
       71.5 |          5        0.09       17.94
       71.6 |         16        0.28       18.22
       71.7 |          4        0.07       18.29
       71.8 |          7        0.12       18.42
       71.9 |         10        0.18       18.59
       72.0 |          8        0.14       18.74
       72.1 |         18        0.32       19.05
       72.2 |         17        0.30       19.35
       72.3 |         24        0.42       19.78
       72.4 |          9        0.16       19.94
       72.5 |         11        0.19       20.13
       72.6 |         10        0.18       20.31
       72.7 |          7        0.12       20.43
       72.8 |          3        0.05       20.48
       72.9 |          4        0.07       20.55
       73.0 |         10        0.18       20.73
       73.1 |         12        0.21       20.94
       73.2 |         20        0.35       21.30
       73.3 |          7        0.12       21.42
       73.4 |         13        0.23       21.65
       73.5 |         15        0.26       21.91
       73.6 |         13        0.23       22.14
       73.7 |         10        0.18       22.32
       73.8 |          4        0.07       22.39
       73.9 |         10        0.18       22.57
       74.0 |         13        0.23       22.80
       74.1 |          3        0.05       22.85
       74.2 |          6        0.11       22.96
       74.3 |         21        0.37       23.33
       74.4 |         16        0.28       23.61
       74.5 |         13        0.23       23.84
       74.6 |         10        0.18       24.02
       74.7 |         10        0.18       24.19
       74.8 |          7        0.12       24.32
       74.9 |          9        0.16       24.47
       75.0 |         13        0.23       24.70
       75.1 |          8        0.14       24.85
       75.2 |         12        0.21       25.06
       75.3 |         17        0.30       25.36
       75.4 |         12        0.21       25.57
       75.5 |         18        0.32       25.89
       75.6 |         10        0.18       26.06
       75.7 |          7        0.12       26.19
       75.8 |         10        0.18       26.36
       75.9 |          9        0.16       26.52
       76.0 |         12        0.21       26.73
       76.1 |          9        0.16       26.89
       76.2 |         10        0.18       27.07
       76.3 |         20        0.35       27.42
       76.4 |          8        0.14       27.56
       76.5 |          6        0.11       27.67
       76.6 |          9        0.16       27.83
       76.7 |         10        0.18       28.01
       76.8 |          8        0.14       28.15
       76.9 |         12        0.21       28.36
       77.0 |          9        0.16       28.52
       77.1 |          9        0.16       28.68
       77.2 |         16        0.28       28.96
       77.3 |          8        0.14       29.10
       77.4 |         11        0.19       29.30
       77.5 |          7        0.12       29.42
       77.6 |          9        0.16       29.58
       77.7 |         15        0.26       29.84
       77.8 |         10        0.18       30.02
       77.9 |         10        0.18       30.20
       78.0 |         10        0.18       30.37
       78.1 |         15        0.26       30.64
       78.2 |         20        0.35       30.99
       78.3 |         22        0.39       31.38
       78.4 |         10        0.18       31.56
       78.5 |         11        0.19       31.75
       78.6 |         17        0.30       32.05
       78.7 |          9        0.16       32.21
       78.8 |          7        0.12       32.33
       78.9 |          9        0.16       32.49
       79.0 |         17        0.30       32.79
       79.1 |         14        0.25       33.04
       79.2 |         12        0.21       33.25
       79.3 |         20        0.35       33.60
       79.4 |         10        0.18       33.78
       79.5 |         13        0.23       34.01
       79.6 |         12        0.21       34.22
       79.7 |         13        0.23       34.45
       79.8 |         13        0.23       34.68
       79.9 |         19        0.34       35.02
       80.0 |         11        0.19       35.21
       80.1 |         17        0.30       35.51
       80.2 |         17        0.30       35.81
       80.3 |         21        0.37       36.18
       80.4 |         14        0.25       36.43
       80.5 |          5        0.09       36.52
       80.6 |         13        0.23       36.75
       80.7 |         13        0.23       36.98
       80.8 |         10        0.18       37.15
       80.9 |         10        0.18       37.33
       81.0 |         11        0.19       37.52
       81.1 |         12        0.21       37.74
       81.2 |         21        0.37       38.11
       81.3 |         18        0.32       38.42
       81.4 |         13        0.23       38.65
       81.5 |          6        0.11       38.76
       81.6 |         19        0.34       39.10
       81.7 |         12        0.21       39.31
       81.8 |         10        0.18       39.48
       81.9 |         14        0.25       39.73
       82.0 |          9        0.16       39.89
       82.1 |         18        0.32       40.21
       82.2 |         24        0.42       40.63
       82.3 |         26        0.46       41.09
       82.4 |         19        0.34       41.43
       82.5 |         15        0.26       41.69
       82.6 |         23        0.41       42.10
       82.7 |         17        0.30       42.40
       82.8 |          2        0.04       42.43
       82.9 |          8        0.14       42.57
       83.0 |          5        0.09       42.66
       83.1 |         15        0.26       42.93
       83.2 |         20        0.35       43.28
       83.3 |         14        0.25       43.53
       83.4 |         16        0.28       43.81
       83.5 |         17        0.30       44.11
       83.6 |         13        0.23       44.34
       83.7 |         10        0.18       44.52
       83.8 |          7        0.12       44.64
       83.9 |         14        0.25       44.89
       84.0 |         11        0.19       45.08
       84.1 |         18        0.32       45.40
       84.2 |         18        0.32       45.72
       84.3 |         21        0.37       46.09
       84.4 |          8        0.14       46.23
       84.5 |         14        0.25       46.48
       84.6 |         18        0.32       46.79
       84.7 |         13        0.23       47.02
       84.8 |          3        0.05       47.08
       84.9 |          8        0.14       47.22
       85.0 |          8        0.14       47.36
       85.1 |         16        0.28       47.64
       85.2 |         37        0.65       48.30
       85.3 |         13        0.23       48.53
       85.4 |         18        0.32       48.84
       85.5 |         11        0.19       49.04
       85.6 |         28        0.49       49.53
       85.7 |         22        0.39       49.92
       85.8 |          8        0.14       50.06
       85.9 |          8        0.14       50.20
       86.0 |          5        0.09       50.29
       86.1 |          6        0.11       50.40
       86.2 |         17        0.30       50.70
       86.3 |         11        0.19       50.89
       86.4 |         12        0.21       51.10
       86.5 |          6        0.11       51.21
       86.6 |         16        0.28       51.49
       86.7 |         18        0.32       51.81
       86.8 |         10        0.18       51.99
       86.9 |         11        0.19       52.18
       87.0 |         10        0.18       52.36
       87.1 |         13        0.23       52.59
       87.2 |         24        0.42       53.01
       87.3 |         30        0.53       53.54
       87.4 |         19        0.34       53.88
       87.5 |         15        0.26       54.14
       87.6 |         23        0.41       54.55
       87.7 |          9        0.16       54.71
       87.8 |          9        0.16       54.86
       87.9 |         16        0.28       55.15
       88.0 |          9        0.16       55.31
       88.1 |          9        0.16       55.47
       88.2 |         14        0.25       55.71
       88.3 |         16        0.28       56.00
       88.4 |         13        0.23       56.22
       88.5 |          9        0.16       56.38
       88.6 |         18        0.32       56.70
       88.7 |         19        0.34       57.04
       88.8 |         10        0.18       57.21
       88.9 |         18        0.32       57.53
       89.0 |         10        0.18       57.71
       89.1 |         13        0.23       57.94
       89.2 |         19        0.34       58.27
       89.3 |         21        0.37       58.64
       89.4 |         16        0.28       58.93
       89.5 |          9        0.16       59.09
       89.6 |         18        0.32       59.40
       89.7 |         16        0.28       59.69
       89.8 |         12        0.21       59.90
       89.9 |         17        0.30       60.20
       90.0 |         20        0.35       60.55
       90.1 |         11        0.19       60.75
       90.2 |         19        0.34       61.08
       90.3 |         26        0.46       61.54
       90.4 |         13        0.23       61.77
       90.5 |          6        0.11       61.88
       90.6 |         23        0.41       62.28
       90.7 |         11        0.19       62.48
       90.8 |         11        0.19       62.67
       90.9 |          7        0.12       62.79
       91.0 |          5        0.09       62.88
       91.1 |         12        0.21       63.09
       91.2 |         21        0.37       63.46
       91.3 |         30        0.53       63.99
       91.4 |         20        0.35       64.35
       91.5 |         10        0.18       64.52
       91.6 |         17        0.30       64.82
       91.7 |         12        0.21       65.04
       91.8 |          9        0.16       65.20
       91.9 |         17        0.30       65.50
       92.0 |         19        0.34       65.83
       92.1 |         10        0.18       66.01
       92.2 |         14        0.25       66.25
       92.3 |         32        0.57       66.82
       92.4 |         15        0.26       67.08
       92.5 |          5        0.09       67.17
       92.6 |         22        0.39       67.56
       92.7 |         18        0.32       67.88
       92.8 |         11        0.19       68.07
       92.9 |         15        0.26       68.34
       93.0 |         10        0.18       68.51
       93.1 |          4        0.07       68.59
       93.2 |         22        0.39       68.97
       93.3 |         12        0.21       69.19
       93.4 |         12        0.21       69.40
       93.5 |         10        0.18       69.57
       93.6 |         16        0.28       69.86
       93.7 |         22        0.39       70.25
       93.8 |         26        0.46       70.70
       93.9 |         12        0.21       70.92
       94.0 |         11        0.19       71.11
       94.1 |         15        0.26       71.38
       94.2 |         22        0.39       71.76
       94.3 |         14        0.25       72.01
       94.4 |         14        0.25       72.26
       94.5 |         10        0.18       72.44
       94.6 |         25        0.44       72.88
       94.7 |         12        0.21       73.09
       94.8 |         13        0.23       73.32
       94.9 |          5        0.09       73.41
       95.0 |         16        0.28       73.69
       95.1 |         19        0.34       74.02
       95.2 |         18        0.32       74.34
       95.3 |         24        0.42       74.77
       95.4 |          9        0.16       74.92
       95.5 |         12        0.21       75.14
       95.6 |         16        0.28       75.42
       95.7 |         16        0.28       75.70
       95.8 |          9        0.16       75.86
       95.9 |          5        0.09       75.95
       96.0 |          6        0.11       76.06
       96.1 |         14        0.25       76.30
       96.2 |         20        0.35       76.66
       96.3 |         21        0.37       77.03
       96.4 |         12        0.21       77.24
       96.5 |         11        0.19       77.43
       96.6 |          6        0.11       77.54
       96.7 |         18        0.32       77.86
       96.8 |         11        0.19       78.05
       96.9 |         11        0.19       78.24
       97.0 |          6        0.11       78.35
       97.1 |          7        0.12       78.47
       97.2 |         10        0.18       78.65
       97.3 |          9        0.16       78.81
       97.4 |          6        0.11       78.92
       97.5 |          4        0.07       78.99
       97.6 |         15        0.26       79.25
       97.7 |         10        0.18       79.43
       97.8 |         15        0.26       79.69
       97.9 |          9        0.16       79.85
       98.0 |          6        0.11       79.96
       98.1 |         11        0.19       80.15
       98.2 |         10        0.18       80.33
       98.3 |         21        0.37       80.70
       98.4 |         14        0.25       80.95
       98.5 |         15        0.26       81.21
       98.6 |         14        0.25       81.46
       98.7 |         13        0.23       81.69
       98.8 |          6        0.11       81.79
       98.9 |         17        0.30       82.09
       99.0 |          4        0.07       82.16
       99.1 |          7        0.12       82.29
       99.2 |         12        0.21       82.50
       99.3 |         11        0.19       82.69
       99.4 |         11        0.19       82.89
       99.5 |          6        0.11       82.99
       99.6 |         10        0.18       83.17
       99.7 |          9        0.16       83.33
       99.8 |         20        0.35       83.68
       99.9 |         14        0.25       83.93
      100.0 |          4        0.07       84.00
      100.1 |          8        0.14       84.14
      100.2 |          7        0.12       84.27
      100.3 |          9        0.16       84.43
      100.4 |         10        0.18       84.60
      100.5 |          8        0.14       84.74
      100.6 |          7        0.12       84.87
      100.7 |          3        0.05       84.92
      100.8 |          3        0.05       84.97
      100.9 |          8        0.14       85.11
      101.0 |          3        0.05       85.17
      101.1 |          4        0.07       85.24
      101.2 |         26        0.46       85.70
      101.3 |         16        0.28       85.98
      101.4 |          4        0.07       86.05
      101.5 |          7        0.12       86.17
      101.6 |          8        0.14       86.31
      101.7 |          7        0.12       86.44
      101.8 |          3        0.05       86.49
      101.9 |          4        0.07       86.56
      102.0 |          5        0.09       86.65
      102.1 |          6        0.11       86.76
      102.2 |          7        0.12       86.88
      102.3 |         13        0.23       87.11
      102.4 |          6        0.11       87.22
      102.5 |          7        0.12       87.34
      102.6 |          7        0.12       87.46
      102.7 |         11        0.19       87.66
      102.8 |          6        0.11       87.76
      102.9 |          6        0.11       87.87
      103.1 |          3        0.05       87.92
      103.2 |         10        0.18       88.10
      103.3 |          2        0.04       88.13
      103.4 |          8        0.14       88.27
      103.5 |          5        0.09       88.36
      103.6 |         11        0.19       88.56
      103.7 |          4        0.07       88.63
      103.8 |          2        0.04       88.66
      103.9 |          3        0.05       88.72
      104.0 |          4        0.07       88.79
      104.1 |          5        0.09       88.88
      104.2 |          9        0.16       89.03
      104.3 |          6        0.11       89.14
      104.4 |          3        0.05       89.19
      104.5 |          2        0.04       89.23
      104.6 |          7        0.12       89.35
      104.7 |          5        0.09       89.44
      104.8 |          3        0.05       89.49
      104.9 |          4        0.07       89.56
      105.0 |          2        0.04       89.60
      105.1 |          2        0.04       89.63
      105.2 |          6        0.11       89.74
      105.3 |          4        0.07       89.81
      105.4 |          1        0.02       89.83
      105.6 |          5        0.09       89.92
      105.7 |          2        0.04       89.95
      105.8 |          5        0.09       90.04
      105.9 |          4        0.07       90.11
      106.0 |          2        0.04       90.15
      106.1 |          3        0.05       90.20
      106.2 |          6        0.11       90.31
      106.3 |          4        0.07       90.38
      106.4 |          3        0.05       90.43
      106.5 |          3        0.05       90.48
      106.6 |          1        0.02       90.50
      106.7 |          3        0.05       90.55
      106.9 |          1        0.02       90.57
      107.1 |          3        0.05       90.62
      107.2 |          3        0.05       90.68
      107.3 |          3        0.05       90.73
      107.4 |          1        0.02       90.75
      107.5 |          1        0.02       90.76
      107.6 |          2        0.04       90.80
      107.7 |          2        0.04       90.84
      107.8 |          3        0.05       90.89
      107.9 |          1        0.02       90.91
      108.0 |          1        0.02       90.92
      108.2 |          1        0.02       90.94
      108.3 |          1        0.02       90.96
      108.4 |          3        0.05       91.01
      108.5 |          2        0.04       91.05
      108.6 |          2        0.04       91.08
      108.7 |          4        0.07       91.15
      108.9 |          2        0.04       91.19
      109.0 |          2        0.04       91.22
      109.1 |          1        0.02       91.24
      109.2 |          1        0.02       91.26
      109.4 |          2        0.04       91.29
      109.6 |          3        0.05       91.35
      110.0 |          1        0.02       91.37
      110.3 |          2        0.04       91.40
      110.6 |          1        0.02       91.42
      111.0 |          1        0.02       91.44
      111.2 |          1        0.02       91.45
      111.4 |          1        0.02       91.47
      111.5 |          1        0.02       91.49
      111.7 |          1        0.02       91.51
      111.8 |          1        0.02       91.52
      112.1 |          1        0.02       91.54
      112.3 |          1        0.02       91.56
      112.5 |          1        0.02       91.58
      112.9 |          1        0.02       91.59
      113.6 |          1        0.02       91.61
      114.2 |          1        0.02       91.63
      114.3 |          1        0.02       91.65
      115.3 |          2        0.04       91.68
      115.9 |          1        0.02       91.70
      116.4 |          1        0.02       91.72
      116.6 |          1        0.02       91.74
      121.8 |          1        0.02       91.75
      999.9 |         55        0.97       92.72
          . |        412        7.28      100.00
------------+-----------------------------------
      Total |      5,663      100.00

. codebook an4 //Check unit of measure – in this case age is measured i
> n centimetres//

-----------------------------------------------------------------------
an4                              Child's length or height (centimetres)
-----------------------------------------------------------------------

                  type:  numeric (double)
                 label:  AN4, but label does not exist

                 range:  [36.4,999.9]                 units:  .1
         unique values:  620                      missing .:  412/5,663

                  mean:   92.7882
              std. dev:   94.2378

           percentiles:        10%       25%       50%       75%       
> 90%
                              65.3      74.3      84.5      93.5      9
> 9.8

. clonevar height = an4
(412 missing values generated)

. desc height 

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------
height          double  %16.1f     AN4        Child's length or height
                                                (centimetres)

. replace height = . if an4>=999 //All missing values or out of range a
> re replaced as "."//
(55 real changes made, 55 to missing)

. tab an2 an4 if an4>=999 | an4==., miss 

   Result of height / |   Child's length or
    length and weight | height (centimetres)
          measurement |     999.9          . |     Total
----------------------+----------------------+----------
Either or both measur |        55          0 |        55 
    Child not present |         0         33 |        33 
Child or mother / car |         0         30 |        30 
                Other |         0         13 |        13 
         Inconsistent |         0          1 |         1 
              Missing |         0         21 |        21 
                    . |         0        314 |       314 
----------------------+----------------------+----------
                Total |        55        412 |       467 

. summ height

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      height |      5,196    83.18637    13.07482       36.4      121.8

. 
. //For children aged below 24 months (<731 days), it makes a differenc
> e whether the child was measured lying down (recumbent), in which cas
> e his/her length was measured, than whether he was measured standing,
>  in which his/her measure is height. The ado can adjust for this diff
> erence. When the kid was measured standing, the ado converts the heig
> ht to recumbent length by adding 0.7cm, and for children aged 24 mont
> hs or above, who are measured in a recumbent position, the ado conver
> ts the length to standing height by subtracting 0.7 cm. The exported 
> variable is _clenhei, which is the converted length/height according 
> to age//
. 
. //In MICS all children under 24 months are supposed to have been meas
> ured in recumbent position, and all children above 24 months are supp
> osed to have been measured in standing position. However, the survey 
> provides a variable that controls for this: an4a, in case a different
>  practice was used in some cases.//
. //NOTE: if an4a is not available, please create as [gen str1 measure=
> " "]//
. codebook an4a

-----------------------------------------------------------------------
an4a                                   Child measured lying or standing
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  AN4A

                 range:  [1,9]                        units:  1
         unique values:  3                        missing .:  467/5,663

            tabulation:  Freq.   Numeric  Label
                         1,997         1  Lying down
                         3,188         2  Standing up
                            11         9  Missing
                           467         .  

. gen measure = "l" if an4a==1 //Child measured lying down//
(3,666 missing values generated)

. replace measure = "h" if an4a==2 //Child measured standing up//
(3,188 real changes made)

. replace measure = " " if an4a==. // No information 
(467 real changes made)

. replace measure = " " if an4a==9 //Replace with " " if unknown or mis
> sing//
(11 real changes made)

. tab measure,m

    measure |      Freq.     Percent        Cum.
------------+-----------------------------------
            |        478        8.44        8.44
          h |      3,188       56.30       64.74
          l |      1,997       35.26      100.00
------------+-----------------------------------
      Total |      5,663      100.00

. 
. * Variable "Oedema" //Only if the variable is available to control fo
> r oedema//
. //NOTE: if not available, please create as [gen str1 oedema = "n"]// 
. gen     str1 oedema = "n" 

. *replace oedema = "y" if an5==1
. *replace oedema = " " if an5==3 | an5==7 | an5==9 | an5==.
. desc    oedema

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------
oedema          str1    %9s                   

. 
. 
. * Variable "Sampling weight"
. //NOTE: if not available, please create as [gen sw = 1]//
. clonevar  sw = chweight

. desc sw

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------
sw              double  %16.6f                Children's sample weight

. summ sw

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          sw |      5,663    .9445524    .7900782          0   5.078034

. 
. 
. ** We now run the command to calculate the z-scores with the adofile
. igrowup_restricted reflib datalib datalab gender age_days ageunit wei
> ght height measure oedema sw

Please wait, programme is running.............

..............................................
Note: z-scores are flagged according to the following rules:
 
                            _zwfl = . if (_zwfl < -5 or _zwfl >5)
                            _zlen = . if (_zlen < -6 or _zlen >6)
                            _zwei = . if (_zwei < -6 or _zwei >5)
                            _zbmi = . if (_zbmi < -5 or _zbmi >5)
                            
file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Datasets\ch
> ildren_nutri_npl_z_rc.dta saved
Note 1:     Original data plus z-scores are written to
            C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Data
> sets\children_nutri_npl_z_rc.dta
                            
                            
Note 2:     Original data plus z-scores are written to
            C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Data
> sets\children_nutri_npl_z_rc.xls
                            

Please wait, programme is calculating prevalences.............

..............................................

Set 1:            Sexes combined

Age groups        Weight-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI     Mean
Total    5071     7.9     7.2     8.7    29.6    28.3    30.8   -1.35
  0-5     458     6.3       4     8.6    19.2    15.4    22.9    -.95
 6-11     486     5.7     3.5     7.8    18.1    14.6    21.7    -.97
12-23     976       7     5.4     8.7      29    26.1    31.9   -1.33
24-35     991     6.5     4.9     8.1    30.9      28    33.9   -1.39
36-47    1099    10.8     8.9    12.7      33    30.1    35.8   -1.52
48-60    1061     8.9     7.2    10.7      35    32.1    37.9   -1.52

           SD
Total     1.2
  0-5    1.31
 6-11    1.26
12-23     1.2
24-35    1.19
36-47    1.18
48-60    1.08

Age groups        Length/height-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI     Mean
Total    5071    15.7    14.7    16.7    37.3      36    38.7   -1.56
  0-5     458     6.1     3.8     8.4    14.2    10.8    17.5    -.63
 6-11     486     4.6     2.7     6.6      16    12.6    19.4    -.76
12-23     976    12.9    10.7    15.1    34.7    31.7    37.7   -1.48
24-35     991    17.8    15.4    20.3    41.6    38.5    44.7   -1.71
36-47    1099    21.6    19.1    24.1    47.9    44.9    50.9   -1.95
48-60    1061    19.2    16.8    21.6    44.6    41.6    47.7   -1.85

           SD
Total     1.5
  0-5    1.46
 6-11    1.46
12-23    1.47
24-35     1.5
36-47    1.41
48-60    1.33

Age groups        Weight-for-length/height

            N  %<-3SD     95%     CI   %<-2SD     95%     CI    %>1SD
Total    5071     3.1     2.6     3.6    11.2    10.3      12     7.1
  0-5     458       7     4.6     9.5    15.7    12.3    19.1    11.6
 6-11     486     5.5     3.4     7.7    14.2      11    17.4     7.5
12-23     976     3.3     2.1     4.4    15.8    13.5    18.2     5.1
24-35     991     2.2     1.2     3.1     9.3     7.4    11.1     6.9
36-47    1099     2.4     1.5     3.4     8.1     6.5     9.8     7.6
48-60    1061     1.6      .8     2.4     8.4     6.7    10.2     6.7

          95%     CI    %>2SD     95%     CI    %>3SD     95%     CI 
Total     6.4     7.8     1.9     1.5     2.3      .6      .4      .9
  0-5     8.6    14.6     4.6     2.6     6.6      .7       0     1.6
 6-11       5     9.9     2.8     1.2     4.3      .2       0      .8
12-23     3.6     6.5      .9      .2     1.5      .5       0       1
24-35     5.2     8.5     1.9       1     2.7      .5       0       1
36-47       6     9.2     1.7      .9     2.5       1      .4     1.7
48-60     5.1     8.2     1.7      .9     2.6      .6      .1     1.2

         Mean      SD
Total    -.64     1.2
  0-5    -.62    1.49
 6-11    -.66    1.33
12-23    -.82     1.2
24-35    -.63    1.13
36-47    -.55    1.15
48-60    -.58     1.1

Age groups        BMI-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI    %>1SD
Total    5071       3     2.5     3.5     9.8       9    10.6     8.4
  0-5     458     6.6     4.2     8.9    18.6      15    22.3     8.9
 6-11     486     6.4     4.1     8.7    14.9    11.6    18.1     7.7
12-23     976     2.8     1.7     3.9    12.4    10.3    14.5     7.7
24-35     991     2.6     1.5     3.6     8.8       7    10.6     8.7
36-47    1099     2.1     1.2       3     6.3     4.8     7.8     9.9
48-60    1061     1.5      .7     2.2     5.9     4.5     7.4     7.5

          95%     CI    %>2SD     95%     CI    %>3SD     95%     CI 
Total     7.6     9.2     2.2     1.8     2.6      .7      .4      .9
  0-5     6.2    11.6       2      .6     3.3      .3       0      .9
 6-11     5.2    10.2     2.3      .9     3.7      .6       0     1.3
12-23     5.9     9.4     1.7      .9     2.6      .6       0     1.1
24-35     6.9    10.5     2.5     1.5     3.6      .7      .2     1.3
36-47     8.1    11.7     2.6     1.6     3.6     1.2      .5     1.8
48-60     5.9     9.1       2     1.1     2.9      .5       0       1

         Mean      SD
Total     -.5    1.22
  0-5    -.83    1.38
 6-11    -.72    1.34
12-23    -.59    1.25
24-35    -.42    1.19
36-47    -.34    1.17
48-60    -.44    1.08

Set 2:            Males

Age groups        Weight-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI     Mean
Total    2617     7.2     6.2     8.2    28.2    26.4    29.9   -1.32
  0-5     241     6.6     3.3      10    19.3    14.1    24.5    -.93
 6-11     252     4.6     1.8     7.4    17.4    12.5    22.3    -.93
12-23     528     6.6     4.4     8.8      31      27    35.1   -1.35
24-35     504       5       3       7    28.9    24.8    32.9   -1.37
36-47     537    10.4     7.7    13.1    30.1    26.2    34.1   -1.48
48-60     555     7.9     5.6    10.2    31.6    27.7    35.6   -1.42

           SD
Total     1.2
  0-5    1.33
 6-11    1.21
12-23    1.22
24-35    1.19
36-47    1.17
48-60    1.09

Age groups        Length/height-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI     Mean
Total    2617    15.5    14.1    16.9    36.2    34.4    38.1   -1.53
  0-5     241       6     2.8     9.2    12.3       8    16.7    -.55
 6-11     252     5.6     2.5     8.6    17.9      13    22.8    -.84
12-23     528      16    12.8    19.2    36.9    32.7    41.1   -1.58
24-35     504    18.8    15.3    22.3    41.2    36.8    45.6    -1.7
36-47     537    19.1    15.6    22.5    46.2    41.8    50.5    -1.9
48-60     555    17.1    13.8    20.3    40.2      36    44.4   -1.73

           SD
Total    1.49
  0-5    1.49
 6-11    1.46
12-23    1.45
24-35    1.47
36-47    1.41
48-60    1.36

Age groups        Weight-for-length/height

            N  %<-3SD     95%     CI   %<-2SD     95%     CI    %>1SD
Total    2617     3.5     2.8     4.2    11.4    10.2    12.7     7.4
  0-5     241     9.7     5.8    13.7      17    12.1      22     9.3
 6-11     252       5     2.1     7.9    11.7     7.5    15.8     9.2
12-23     528     2.8     1.3     4.3    15.7    12.5    18.9     6.7
24-35     504     2.7     1.2     4.3       9     6.4    11.6     6.7
36-47     537     3.1     1.5     4.6     8.8     6.3    11.3     6.5
48-60     555     1.9      .7     3.1     9.6       7    12.1     7.7

          95%     CI    %>2SD     95%     CI    %>3SD     95%     CI 
Total     6.4     8.4     1.8     1.3     2.4      .5      .2      .8
  0-5     5.4    13.2     3.9     1.3     6.6      .5       0     1.7
 6-11     5.5      13     2.9      .6     5.1      .4       0     1.4
12-23     4.5     8.9     1.5      .4     2.7       1       0     1.9
24-35     4.5       9     1.7      .5       3      .5       0     1.3
36-47     4.4     8.7      .9       0     1.8      .6       0     1.3
48-60     5.4      10     1.7      .5     2.9      .1       0      .4

         Mean      SD
Total    -.65    1.22
  0-5     -.7    1.54
 6-11    -.55    1.33
12-23    -.81    1.25
24-35    -.67    1.15
36-47    -.59    1.11
48-60    -.59    1.12

Age groups        BMI-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI    %>1SD
Total    2617     3.3     2.6     4.1     9.8     8.6      11     8.9
  0-5     241     9.6     5.7    13.5    19.2      14    24.4     6.9
 6-11     252     5.6     2.6     8.7    13.2     8.8    17.6     9.3
12-23     528       3     1.5     4.6      12     9.1    14.8     9.3
24-35     504     2.2      .8     3.6     8.9     6.3    11.4     8.7
36-47     537     2.4       1     3.8     6.7     4.5     8.9     9.2
48-60     555     1.8      .6     3.1     5.9     3.9       8       9

          95%     CI    %>2SD     95%     CI    %>3SD     95%     CI 
Total     7.8      10     2.1     1.6     2.7      .7      .3       1
  0-5     3.5    10.3     1.3       0     2.9      .4       0     1.5
 6-11     5.5      13       2      .1     3.9      .4       0     1.4
12-23     6.7    11.8     2.9     1.4     4.4       1      .1       2
24-35     6.1    11.2     2.3      .9     3.8       1       0       2
36-47     6.7    11.8     1.6      .5     2.8      .7       0     1.5
48-60     6.6    11.5     2.1      .9     3.4      .3       0      .8

         Mean      SD
Total    -.48    1.23
  0-5    -.87    1.42
 6-11    -.59    1.34
12-23    -.55     1.3
24-35    -.42    1.18
36-47    -.33    1.11
48-60    -.41     1.1

Set 3:            Females

Age groups        Weight-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI     Mean
Total    2454     8.8     7.6     9.9    31.1    29.2    32.9   -1.39
  0-5     217     5.9     2.6     9.3      19    13.6    24.5    -.98
 6-11     234     6.8     3.4    10.2    18.9    13.7    24.2   -1.01
12-23     448     7.5     4.9      10    26.7    22.5    30.9    -1.3
24-35     487     8.1     5.5    10.6    33.1    28.8    37.4   -1.41
36-47     563    11.1     8.4    13.8    35.7    31.6    39.7   -1.56
48-60     506    10.1     7.4    12.8    38.8    34.4    43.1   -1.62

           SD
Total    1.21
  0-5    1.28
 6-11    1.32
12-23    1.18
24-35    1.21
36-47    1.19
48-60    1.07

Age groups        Length/height-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI     Mean
Total    2454    15.9    14.4    17.4    38.5    36.5    40.4   -1.59
  0-5     217     6.2     2.8     9.7    16.2    11.1    21.3    -.71
 6-11     234     3.7       1     6.3      14     9.3    18.6    -.67
12-23     448     9.3     6.5    12.1    32.1    27.7    36.5   -1.37
24-35     487    16.8    13.4    20.3      42    37.5    46.5   -1.72
36-47     563      24    20.4    27.6    49.5    45.3    53.7      -2
48-60     506    21.6    17.9    25.2    49.4      45    53.9   -1.99

           SD
Total    1.51
  0-5    1.43
 6-11    1.45
12-23    1.48
24-35    1.54
36-47     1.4
48-60    1.28

Age groups        Weight-for-length/height

            N  %<-3SD     95%     CI   %<-2SD     95%     CI    %>1SD
Total    2454     2.6       2     3.3    10.9     9.6    12.1     6.9
  0-5     217     4.1     1.2     6.9    14.2     9.3    19.1    14.1
 6-11     234     6.1     2.8     9.4      17    11.9      22     5.5
12-23     448     3.8     1.9     5.7      16    12.5    19.5     3.1
24-35     487     1.6      .4     2.8     9.5     6.8    12.3       7
36-47     563     1.8      .6       3     7.5     5.2     9.7     8.6
48-60     506     1.2      .2     2.3     7.2     4.8     9.5     5.5

          95%     CI    %>2SD     95%     CI    %>3SD     95%     CI 
Total     5.8     7.9       2     1.5     2.6      .8      .4     1.2
  0-5     9.3      19     5.3     2.1     8.5       1       0     2.5
 6-11     2.4     8.7     2.6      .4     4.9      .1       0      .7
12-23     1.4     4.9      .1       0      .4       0       0      .2
24-35     4.6     9.3       2      .6     3.3      .5       0     1.2
36-47     6.2      11     2.4       1     3.8     1.5      .4     2.6
48-60     3.5     7.6     1.8      .5       3     1.3      .2     2.3

         Mean      SD
Total    -.63    1.19
  0-5    -.54    1.44
 6-11    -.78    1.33
12-23    -.84    1.15
24-35     -.6    1.11
36-47    -.52    1.19
48-60    -.58    1.09

Age groups        BMI-for-age

            N  %<-3SD     95%     CI   %<-2SD     95%     CI    %>1SD
Total    2454     2.6       2     3.3     9.8     8.6      11     7.9
  0-5     217     3.2      .6     5.8      18    12.6    23.3    11.1
 6-11     234     7.2     3.7    10.8    16.7    11.7    21.6       6
12-23     448     2.6       1     4.1    12.9     9.7    16.1     5.8
24-35     487     2.9     1.3     4.5     8.7     6.1    11.3     8.6
36-47     563     1.8      .6       3     5.9     3.9     7.9    10.5
48-60     506       1       0       2     5.9     3.8     8.1     5.8

          95%     CI    %>2SD     95%     CI    %>3SD     95%     CI 
Total     6.9       9     2.3     1.7     2.9      .7      .3       1
  0-5     6.7    15.5     2.7      .3     5.1      .1       0      .8
 6-11     2.7     9.3     2.6      .4     4.9      .7       0       2
12-23     3.5     8.1      .4       0     1.1       0       0      .2
24-35       6    11.2     2.7     1.2     4.3      .5       0     1.2
36-47     7.9    13.2     3.5     1.9     5.1     1.6      .5     2.7
48-60     3.7       8     1.8      .5       3      .7       0     1.6

         Mean      SD
Total    -.53    1.21
  0-5    -.79    1.34
 6-11    -.85    1.34
12-23    -.62    1.19
24-35    -.42    1.19
36-47    -.35    1.23
48-60    -.48    1.05
 
Note:       Prevalences are written to
            C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Data
> sets\children_nutri_npl_prev_rc.xls

. 
. ** We now turn to using the dta file that was created and that contai
> ns the calculated z-scores
. use "$workingfolder_out\children_nutri_npl_z_rc.dta", clear //Change 
> name accordingly//

. 
. gen     z_scorewa = _zwei
(422 missing values generated)

. replace z_scorewa = . if _fwei==1 
(6 real changes made, 6 to missing)

. lab var z_scorewa "z-score weight-for-age WHO"

. *scatter z_scorewa waz2 if waz2<90  // we obtain the same results/100
>  as the MICS 
. ** Now we create the under weight-for-age variable with WHO
. gen     underwa2 = (z_scorewa < -2.0) //Takes value 1 if the child is
>  under 2 stdev below the median and 0 otherwise//

. replace underwa2 = . if z_scorewa==.
(428 real changes made, 428 to missing)

. lab var underwa2  "Child is undernourished (weight-for-age) 2sd - WHO
> "

. 
. * Ultrapoverty indicator
. gen     underwa3 = (z_scorewa < -3.0) //Takes value 1 if the child is
>  under 3 stdev below the median and 0 otherwise//

. replace underwa3 = . if z_scorewa==.
(428 real changes made, 428 to missing)

. lab var underwa3  "Child is undernourished (weight-for-age) 3sd - WHO
> "

. 
. gen stunting = (_zlen < -2.0)

. replace stunting = . if _zlen == . | _flen==1
(525 real changes made, 525 to missing)

. lab var stunting "Child is undernourished (lenght/height-for-age) 2sd
>  - WHO"

. gen stunting3 = (_zlen < -3.0)

. replace stunting3 = . if _zlen == . | _flen==1
(525 real changes made, 525 to missing)

. lab var stunting3 "Child is undernourished (lenght/height-for-age) 3s
> d - WHO"

. 
. gen wasting = (_zwfl < - 2.0)

. replace wasting = . if _zwfl == . | _fwfl == 1
(528 real changes made, 528 to missing)

. lab var wasting  "Child is undernourished (weight-for-lenght/height) 
> 2sd - WHO"

. gen wasting3 = (_zwfl < - 3.0)

. replace wasting3 = . if _zwfl == . | _fwfl == 1
(528 real changes made, 528 to missing)

. lab var wasting3  "Child is undernourished (weight-for-lenght/height)
>  3sd - WHO"

. 
. su z_scorewa underwa2   underwa3        stunting        stunting3    
>    wasting         wasting3 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   z_scorewa |      5,235   -1.390149    1.217676         -6       3.68
    underwa2 |      5,235    .2974212    .4571671          0          1
    underwa3 |      5,235    .0848138     .278631          0          1
    stunting |      5,138    .4100817    .4918961          0          1
   stunting3 |      5,138    .1831452    .3868232          0          1
-------------+---------------------------------------------------------
     wasting |      5,135     .097371    .2964911          0          1
    wasting3 |      5,135    .0270691    .1623007          0          1

. 
. *We do not have information on ethnicity or religion for children
. *** Save a temp file for merging with WM, IR and MR
. 
. keep  ind_id hl4 cage hh1 hh2 ln chweight child_CH z_score* under* st
> un* wast* _* 

. order ind_id hl4 cage hh1 hh2 ln chweight child_CH z_score* under*

. 
. sort ind_id

. save "$workingfolder_out\npl14_CH.dta", replace
(note: file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Data
> sets\npl14_CH.dta not found)
file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Datasets\np
> l14_CH.dta saved

. 
. *********************************************************************
> ********************
. *** Step 1.2 WM – Women Level (all eligible females between 15-49 yea
> rs in the household) ***
. *********************************************************************
> *********************
. use "$workingfolder_in\wm.dta", clear 

. *I convert names to lower caps
. rename _all, lower

. *** Generate individual unique key variable required for data merging
. *** hh1 = cluster number; hh2 = household number; ln = respondent’s l
> ine number
. gen double ind_id = hh1*100000 + hh2*100 + ln //Please check length o
> f variables for a correct generation of the id variable//

. format ind_id %20.0g

. label var ind_id "Individual ID"

. 
. duplicates report ind_id

Duplicates in terms of ind_id

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |        14936             0
--------------------------------------

. 
. gen women_WM = 1 //Identification variable for observations in WM rec
> ode//

. ta ma5 cm1,m //No subsample of ever-married women//

Ever married or lived |         Ever given birth
           with a man |       Yes         No          . |     Total
----------------------+---------------------------------+----------
Yes, formerly married |       301         16          0 |       317 
Yes, formerly lived w |         3          2          0 |         5 
                   No |         4      3,148          0 |     3,152 
                    . |     9,645      1,043        774 |    11,462 
----------------------+---------------------------------+----------
                Total |     9,953      4,209        774 |    14,936 

. * We retain the following variables: wb2: age; wmweight: sample weigh
> t; cm1: ever given birth; cm8: ever had child who later died; 
. * cm9a: sons who have died; cm9b: daughters who have died; cm10: tota
> l children ever born; ma1: currently married; ma5: ever married
. *no info of ethnicity or religion
. codebook wb2 wm7 cm1 cm8 cm9a cm9b cm10 ma1 ma5 ind_id women_WM wmwei
> ght

-----------------------------------------------------------------------
wb2                                                        Age of woman
-----------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [15,49]                      units:  1
         unique values:  35                       missing .:  774/14,93
> 6

                  mean:   29.2478
              std. dev:   9.61191

           percentiles:        10%       25%       50%       75%       
> 90%
                                17        21        28        37       
>  44

-----------------------------------------------------------------------
wm7                                         Result of woman's interview
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  WM7

                 range:  [1,96]                       units:  1
         unique values:  6                        missing .:  0/14,936

            tabulation:  Freq.   Numeric  Label
                        14,162         1  Completed
                           677         2  Not at home
                            17         3  Refused
                             3         4  Partly completed
                            56         5  Incapacitated
                            21        96  Other

-----------------------------------------------------------------------
cm1                                                    Ever given birth
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  CM1

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  774/14,93
> 6

            tabulation:  Freq.   Numeric  Label
                         9,953         1  Yes
                         4,209         2  No
                           774         .  

-----------------------------------------------------------------------
cm8                                       Ever had child who later died
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  CM8

                 range:  [1,9]                        units:  1
         unique values:  3                        missing .:  774/14,93
> 6

            tabulation:  Freq.   Numeric  Label
                         1,636         1  Yes
                        12,524         2  No
                             2         9  Missing
                           774         .  

-----------------------------------------------------------------------
cm9a                                                          Boys dead
-----------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,8]                        units:  1
         unique values:  7                        missing .:  13,300/14
> ,936

            tabulation:  Freq.  Value
                           635  0
                           836  1
                           137  2
                            19  3
                             6  4
                             2  5
                             1  8
                        13,300  .

-----------------------------------------------------------------------
cm9b                                                         Girls dead
-----------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,6]                        units:  1
         unique values:  7                        missing .:  13,300/14
> ,936

            tabulation:  Freq.  Value
                           756  0
                           729  1
                           126  2
                            17  3
                             5  4
                             2  5
                             1  6
                        13,300  .

-----------------------------------------------------------------------
cm10                                                 Children ever born
-----------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,12]                       units:  1
         unique values:  13                       missing .:  774/14,93
> 6

                  mean:   2.02281
              std. dev:   1.90268

           percentiles:        10%       25%       50%       75%       
> 90%
                                 0         0         2         3       
>   5

-----------------------------------------------------------------------
ma1                              Currently married or living with a man
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  MA1

                 range:  [1,3]                        units:  1
         unique values:  3                        missing .:  774/14,93
> 6

            tabulation:  Freq.   Numeric  Label
                        10,634         1  Yes, currently married
                            54         2  Yes, living with a man
                         3,474         3  No, not in union
                           774         .  

-----------------------------------------------------------------------
ma5                                    Ever married or lived with a man
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  MA5

                 range:  [1,3]                        units:  1
         unique values:  3                        missing .:  11,462/14
> ,936

            tabulation:  Freq.   Numeric  Label
                           317         1  Yes, formerly married
                             5         2  Yes, formerly lived with a ma
> n
                         3,152         3  No
                        11,462         .  

-----------------------------------------------------------------------
ind_id                                                    Individual ID
-----------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [100102,52002506]            units:  1
         unique values:  14,936                   missing .:  0/14,936

                  mean:   2.7e+07
              std. dev:   1.5e+07

           percentiles:        10%       25%       50%       75%       
> 90%
                           5.6e+06   1.4e+07   2.8e+07   4.0e+07   4.8e
> +07

-----------------------------------------------------------------------
women_WM                                                    (unlabeled)
-----------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  0/14,936

            tabulation:  Freq.  Value
                        14,936  1

-----------------------------------------------------------------------
wmweight                                          Women's sample weight
-----------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,5.0553328]                units:  1.000e-10
         unique values:  515                      missing .:  0/14,936

                  mean:   .948179
              std. dev:   .749625

           percentiles:        10%       25%       50%       75%       
> 90%
                           .192205   .255645   .864409   1.33261   2.05
> 752

. 
. keep wb2 wm7 cm1 cm8 cm9a cm9b cm10 ma1 ma5 ind_id women_WM wmweight 
> ta1-ta17

. order wb2 wm7 cm1 cm8 cm9a cm9b cm10 ma1 ma5 ind_id women_WM wmweight

. 
. sort ind_id

. 
. *** Save temp file for future merging
. save "$workingfolder_out\npl14_WM.dta", replace
(note: file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Data
> sets\npl14_WM.dta not found)
file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Datasets\np
> l14_WM.dta saved

. 
. *********************************************
. *** Step 1.3 HH – Household Characteristics
. *********************************************
. 
. use "$workingfolder_in\hh.dta", clear //Change to the corresponding H
> H-file//

. *I convert names to lower caps
. rename _all, lower

. *** Generate a household unique key variable required to prepare the 
> MPI indicators at the household level ***
. *** We construct the household id using hh1: cluster number and hh2: 
> household number
. gen     double hh_id = hh1*1000 + hh2 //Please check length of variab
> les for a correct generation of the id variable//

. format  hh_id %20.0g

. lab var hh_id "Household ID"

. 
. 
. *** Save temp file for future merging
. save "$workingfolder_out\npl14_HH.dta", replace
(note: file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Data
> sets\npl14_HH.dta not found)
file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Datasets\np
> l14_HH.dta saved

. 
. ********************************************
. *Step 1.4 No Male Recode , but Birth recode*
. ********************************************
. /*use "$workingfolder_in\mn.dta", clear //Change to the corresponding
>  MN-file//
> *I convert names to lower caps
> rename _all, lower
> gen     double hh_id = hh1*1000 + hh2 //Please check length of variab
> les for a correct generation of the id variable//
> format  hh_id %20.0g
> lab var hh_id "Household ID"
> 
> *** Generate individual unique key variable required for data merging
> *** hh1 = cluster number; hh2 = household number; ln = respondent’s l
> ine number
> gen double ind_id = hh1*100000 + hh2*100 + ln //Please check length o
> f variables for a correct generation of the id variable//
> 
> *** Save temp file for future merging
> save "$workingfolder_out\npl14_MN.dta", replace
> */
. 
. use "$workingfolder_in\bh.dta", clear 

. rename _all, lower

. *** Generate individual unique key variable required for data merging
. *** hh1 = cluster number; hh2 = household number; ln = respondent’s l
> ine number
. gen double ind_id = hh1*100000 + hh2*100 + ln //Please check length o
> f variables for a correct generation of the id variable//

. format ind_id %20.0g

. label var ind_id "Individual ID"

. 
. gen double ind_c = hh1*10000000 + hh2*10000 + ln*100 + bhln //Please 
> check length of variables for a correct generation of the id variable
> //

. 
. duplicates report ind_c

Duplicates in terms of ind_c

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |        28647             0
--------------------------------------

. 
. gen women_BH = 1 //Identification variable for observations in WM rec
> ode//

. 
. * We retain the following variables: bh5: still alive; bh9u: unit of 
> age at dead; bh9n: age at dead; bh9c: check; bh9f: flag. 
. 
. bys ind_id: egen tbirths_=max(bhln)  

. ta bh5 bh9u,m  //only not alive offspring has age at death

     Still |            Age at death (units)
     alive |      Days     Months      Years    Missing |     Total
-----------+--------------------------------------------+----------
       Yes |         0          0          0          0 |    26,370 
        No |     1,011        848        407         11 |     2,277 
-----------+--------------------------------------------+----------
     Total |     1,011        848        407         11 |    28,647 


           |   Age at
           |   death
     Still |  (units)
     alive |         . |     Total
-----------+-----------+----------
       Yes |    26,370 |    26,370 
        No |         0 |     2,277 
-----------+-----------+----------
     Total |    26,370 |    28,647 

. 
. 
. keep wmweight hh1 hh2 ln tbirths_ bhln bh5 bh9* ind_id women_BH

. *check that age at dead inputed is valid for almost all children not 
> alive
. bys bh9f : ta bh9c bh5 ,m  //all but 1 of 15 imputations are under 5 
> years old, most of them lack of unit This dofile relies on the imputa
> tion.

-----------------------------------------------------------------------
-> bh9f = No flag

    Age at |
     death |   Still
    months |   alive
 (imputed) |        No |     Total
-----------+-----------+----------
         0 |     1,008 |     1,008 
         1 |       149 |       149 
         2 |        80 |        80 
         3 |       104 |       104 
         4 |        39 |        39 
         5 |        55 |        55 
         6 |        70 |        70 
         7 |        40 |        40 
         8 |        47 |        47 
         9 |        43 |        43 
        10 |        19 |        19 
        11 |        15 |        15 
        12 |       133 |       133 
        13 |         7 |         7 
        14 |         4 |         4 
        15 |         6 |         6 
        16 |         5 |         5 
        17 |         4 |         4 
        18 |        21 |        21 
        19 |         4 |         4 
        20 |         1 |         1 
        21 |         2 |         2 
        22 |         1 |         1 
        24 |       102 |       102 
        36 |        59 |        59 
        48 |        40 |        40 
        60 |        48 |        48 
        72 |        23 |        23 
        84 |         9 |         9 
        96 |        21 |        21 
       108 |         9 |         9 
       120 |         9 |         9 
       132 |         7 |         7 
       144 |         7 |         7 
       156 |         9 |         9 
       168 |         8 |         8 
       180 |         8 |         8 
       192 |         7 |         7 
       204 |         4 |         4 
       216 |        11 |        11 
       228 |         5 |         5 
       240 |         8 |         8 
       252 |         3 |         3 
       264 |         1 |         1 
       276 |         2 |         2 
       288 |         1 |         1 
       300 |         2 |         2 
       324 |         1 |         1 
       360 |         1 |         1 
-----------+-----------+----------
     Total |     2,262 |     2,262 

-----------------------------------------------------------------------
-> bh9f = Imputed, units g

    Age at |
     death |   Still
    months |   alive
 (imputed) |        No |     Total
-----------+-----------+----------
         0 |         3 |         3 
        24 |         1 |         1 
-----------+-----------+----------
     Total |         4 |         4 

-----------------------------------------------------------------------
-> bh9f = Imputed, no unit

    Age at |
     death |   Still
    months |   alive
 (imputed) |        No |     Total
-----------+-----------+----------
         0 |         7 |         7 
         2 |         1 |         1 
         3 |         1 |         1 
         6 |         1 |         1 
        60 |         1 |         1 
-----------+-----------+----------
     Total |        11 |        11 

-----------------------------------------------------------------------
-> bh9f = .

    Age at |
     death |   Still
    months |   alive
 (imputed) |       Yes |     Total
-----------+-----------+----------
         . |    26,370 |    26,370 
-----------+-----------+----------
     Total |    26,370 |    26,370 


. bys bh9f : ta bh9c bh9u if bh9f>=7 & bh9f<=8 ,m  //all but 1 of 15 im
> putations are under 5 years old, most of them lack of unit This dofil
> e relies on the imputation.

-----------------------------------------------------------------------
-> bh9f = No flag
no observations

-----------------------------------------------------------------------
-> bh9f = Imputed, units g

    Age at |
     death |
    months | Age at death (units)
 (imputed) |      Days      Years |     Total
-----------+----------------------+----------
         0 |         2          1 |         3 
        24 |         0          1 |         1 
-----------+----------------------+----------
     Total |         2          2 |         4 

-----------------------------------------------------------------------
-> bh9f = Imputed, no unit

    Age at |   Age at
     death |   death
    months |  (units)
 (imputed) |   Missing |     Total
-----------+-----------+----------
         0 |         7 |         7 
         2 |         1 |         1 
         3 |         1 |         1 
         6 |         1 |         1 
        60 |         1 |         1 
-----------+-----------+----------
     Total |        11 |        11 

-----------------------------------------------------------------------
-> bh9f = .
no observations


. 
. gen dufive_ = cond(bh9c<60,1,0)

. replace dufive_ = . if bh9c == .
(26,370 real changes made, 26,370 to missing)

. ta bh9f dufive, m   //2072 deaths of under five of which 14 has imput
> ed age, 10 of them we have no further info.

                     |             dufive_
  Date flag for BH9C |         0          1          . |     Total
---------------------+---------------------------------+----------
             No flag |       204      2,058          0 |     2,262 
Imputed, units given |         0          4          0 |         4 
   Imputed, no units |         1         10          0 |        11 
                   . |         0          0     26,370 |    26,370 
---------------------+---------------------------------+----------
               Total |       205      2,072     26,370 |    28,647 

. ren bh5 bh5_ 

. ren bh9* bh9*_

. 
. reshape wide bh5 bh9* dufive_, i(ind_id) j(bhln)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12)

Data                               long   ->   wide
-----------------------------------------------------------------------
> ------
Number of obs.                    28647   ->    9962
Number of variables                  14   ->      79
j variable (12 values)             bhln   ->   (dropped)
xij variables:
                                   bh5_   ->   bh5_1 bh5_2 ... bh5_12
                                  bh9u_   ->   bh9u_1 bh9u_2 ... bh9u_1
> 2
                                  bh9n_   ->   bh9n_1 bh9n_2 ... bh9n_1
> 2
                                  bh9c_   ->   bh9c_1 bh9c_2 ... bh9c_1
> 2
                                  bh9f_   ->   bh9f_1 bh9f_2 ... bh9f_1
> 2
                                dufive_   ->   dufive_1 dufive_2 ... du
> five_12
-----------------------------------------------------------------------
> ------

. egen tdufive = rowtotal(dufive_*)

. ta tdufive, m   //1110+(289*2)+(3*74)+(4*20)+(5*7)+47 = 2072 deaths u
> nder five which coincide with the original dataset

    tdufive |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,455       84.87       84.87
          1 |      1,110       11.14       96.01
          2 |        289        2.90       98.92
          3 |         74        0.74       99.66
          4 |         20        0.20       99.86
          5 |          7        0.07       99.93
          6 |          3        0.03       99.96
          7 |          3        0.03       99.99
          8 |          1        0.01      100.00
------------+-----------------------------------
      Total |      9,962      100.00

. 
. sort ind_id

. *** Save temp file for future merging
. save "$workingfolder_out\npl14_BH.dta", replace
(note: file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Data
> sets\npl14_BH.dta not found)
file C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Datasets\np
> l14_BH.dta saved

. 
. ******************************************************
. *** Step 1.5 HL – Household Member Level **************
. ******************************************************
. use "$workingfolder_in\hl.dta", clear 

. *I convert names to lower caps
. rename _all, lower

. 
. *Please check the official name of the country you are analysing in t
> he List of Member States of the United Nations
. *http://www.un.org/en/members/index.shtml
. gen country = "Nepal" 

. *Please create a string of the year of fieldwork of the survey accord
> ing to the report
. *p. 2 of Nepal's report says from February till June 2014
. gen year_published = "2014"

. *Please create a variable that records the numeric year of survey. If
>  it occurred in two years, please select the most recent of them
. gen year = 2014

. gen survey = "MICS"

. 
. *** Generate a household unique key variable required to prepare the 
> MPI indicators at the household level ***
. *** We construct the household id using hh1= cluster number and hh2 =
>  household number
. gen double hh_id = hh1*1000 + hh2 //Please check length of variables 
> for a correct generation of the id variable//

. format hh_id %20.0g

. label var hh_id "Household ID"

. 
. *** Generate individual unique key variable required for data merging
. *** hh1 = cluster number; hh2 = household number; hl1 = respondent’s 
> line number
. gen double ind_id = hh1*100000 + hh2*100 + hl1 //Please check length 
> of variables for a correct generation of the id variable//

. format ind_id %20.0g

. label var ind_id "Individual ID"

. 
. *********************************************************************
> ********
. *** Step 1.6 DATA MERGING (HL, WM, CH) & Control Variables **********
> ***
.  ********************************************************************
> ********
. 
. **************************************
. *** 1.6a DATA MERGING ***********
. **************************************
. 
. *** Merging WM Recode
. merge 1:1 ind_id using "$workingfolder_out\npl14_WM.dta"   ###match

    Result                           # of obs.
    -----------------------------------------
    not matched                        41,603
        from master                    41,603  (_merge==1)
        from using                          0  (_merge==2)

    matched                            14,936  (_merge==3)
    -----------------------------------------

. 
. gen temp = (hl7>0) 

. tab women_WM temp, miss col  ###match

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         temp
  women_WM |         0          1 |     Total
-----------+----------------------+----------
         1 |         0     14,936 |    14,936 
           |      0.00     100.00 |     26.42 
-----------+----------------------+----------
         . |    41,603          0 |    41,603 
           |    100.00       0.00 |     73.58 
-----------+----------------------+----------
     Total |    41,603     14,936 |    56,539 
           |    100.00     100.00 |    100.00 

. tab wm7 if temp==1 & women_WM==.  //Total of eligible women not inter
> viewed//   ### match
no observations

. ta hl6 hl4 if _m==1,m   //only men and non-eligible women are not mer
> ged.  ###match

           |          Sex
       Age |      Male     Female |     Total
-----------+----------------------+----------
         0 |       593        508 |     1,101 
         1 |       570        519 |     1,089 
         2 |       583        531 |     1,114 
         3 |       601        587 |     1,188 
         4 |       618        553 |     1,171 
         5 |       609        602 |     1,211 
         6 |       685        646 |     1,331 
         7 |       685        682 |     1,367 
         8 |       688        686 |     1,374 
         9 |       560        592 |     1,152 
        10 |       796        824 |     1,620 
        11 |       626        576 |     1,202 
        12 |       758        804 |     1,562 
        13 |       675        769 |     1,444 
        14 |       687        783 |     1,470 
        15 |       653          0 |       653 
        16 |       622          0 |       622 
        17 |       546          0 |       546 
        18 |       680          0 |       680 
        19 |       404          0 |       404 
        20 |       525          0 |       525 
        21 |       384          0 |       384 
        22 |       403          0 |       403 
        23 |       350          0 |       350 
        24 |       350          0 |       350 
        25 |       459          0 |       459 
        26 |       335          0 |       335 
        27 |       287          0 |       287 
        28 |       386          0 |       386 
        29 |       267          0 |       267 
        30 |       507          0 |       507 
        31 |       277          0 |       277 
        32 |       348          0 |       348 
        33 |       210          0 |       210 
        34 |       252          0 |       252 
        35 |       545          0 |       545 
        36 |       291          0 |       291 
        37 |       202          0 |       202 
        38 |       318          0 |       318 
        39 |       194          0 |       194 
        40 |       497          0 |       497 
        41 |       202          0 |       202 
        42 |       341          0 |       341 
        43 |       193          0 |       193 
        44 |       204          0 |       204 
        45 |       441          0 |       441 
        46 |       248          0 |       248 
        47 |       201          0 |       201 
        48 |       263          0 |       263 
        49 |       193          0 |       193 
        50 |       362        455 |       817 
        51 |       191        287 |       478 
        52 |       274        356 |       630 
        53 |       168        219 |       387 
        54 |       180        205 |       385 
        55 |       346        321 |       667 
        56 |       189        203 |       392 
        57 |       164        147 |       311 
        58 |       182        162 |       344 
        59 |       135        121 |       256 
        60 |       379        401 |       780 
        61 |       136        164 |       300 
        62 |       138        144 |       282 
        63 |       132        125 |       257 
        64 |       118         91 |       209 
        65 |       210        257 |       467 
        66 |       122        114 |       236 
        67 |        98         88 |       186 
        68 |       112         91 |       203 
        69 |       117        106 |       223 
        70 |       180        214 |       394 
        71 |        66         51 |       117 
        72 |        67         73 |       140 
        73 |        58         45 |       103 
        74 |        53         36 |        89 
        75 |        94         99 |       193 
        76 |        44         43 |        87 
        77 |        35         20 |        55 
        78 |        43         26 |        69 
        79 |        17         24 |        41 
        80 |        78         89 |       167 
        81 |        29         23 |        52 
        82 |        26         28 |        54 
        83 |        17          8 |        25 
        84 |        30         14 |        44 
        85 |        25         28 |        53 
        86 |        12         10 |        22 
        87 |         4          5 |         9 
        88 |         9         11 |        20 
        89 |         2          4 |         6 
        90 |         5         20 |        25 
        91 |         3          3 |         6 
        92 |         3          3 |         6 
        93 |         4          2 |         6 
        94 |         0          3 |         3 
       95+ |        13         16 |        29 
        DK |         1          2 |         3 
   Missing |         0          1 |         1 
-----------+----------------------+----------
     Total |    26,983     14,620 |    41,603 

. drop temp _merge

. 
. erase "$workingfolder_out\npl14_WM.dta"

. 
. /*No Merging MN Recode (Male) for Nepal
> merge 1:1 ind_id using "$workingfolder_out\mwi13-14_mn.dta"
> drop _merge
> erase "$workingfolder_out\mwi13-14_mn.dta"
> */
. *** Merging HH Recode
. merge m:1 hh_id using "$workingfolder_out\npl14_HH.dta"
(label windex5 already defined)
(label helevel already defined)
(label HH7 already defined)
(label HH6 already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           570
        from master                         0  (_merge==1)
        from using                        570  (_merge==2)

    matched                            56,539  (_merge==3)
    -----------------------------------------

. ta hh9 if _m==2,m

                 Result of HH interview |      Freq.     Percent       
>  Cum.
----------------------------------------+------------------------------
> -----
No household member or no competent res |         69       12.11       
> 12.11
Entire household absent for extended ti |        106       18.60       
> 30.70
                                Refused |         11        1.93       
> 32.63
Dwelling vacant / Address not a dwellin |        248       43.51       
> 76.14
                     Dwelling destroyed |         21        3.68       
> 79.82
                     Dwelling not found |        113       19.82       
> 99.65
                                  Other |          2        0.35      1
> 00.00
----------------------------------------+------------------------------
> -----
                                  Total |        570      100.00

. * 570 HHs not merged from Using, all of them due to problems in the i
> nterview
. drop  if _merge==2
(570 observations deleted)

. drop _merge

. 
. erase "$workingfolder_out\npl14_HH.dta"

. 
. *** Merging CH Recode
. merge 1:1 ind_id using "$workingfolder_out\npl14_CH.dta"
(label HL4 already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        50,876
        from master                    50,876  (_merge==1)
        from using                          0  (_merge==2)

    matched                             5,663  (_merge==3)
    -----------------------------------------

. 
. count if ln==0 //The children without household line are unique to th
> e CH Recode//
  0  ###matched


. ta hl6 if _m==1,m   //only 5 years old and older are not merged. ###matched

        Age |      Freq.     Percent        Cum.
------------+-----------------------------------
          5 |      1,211        2.38        2.38
          6 |      1,331        2.62        5.00
          7 |      1,367        2.69        7.68
          8 |      1,374        2.70       10.38
          9 |      1,152        2.26       12.65
         10 |      1,620        3.18       15.83
         11 |      1,202        2.36       18.20
         12 |      1,562        3.07       21.27
         13 |      1,444        2.84       24.10
         14 |      1,470        2.89       26.99
         15 |      1,204        2.37       29.36
         16 |      1,279        2.51       31.87
         17 |      1,079        2.12       33.99
         18 |      1,438        2.83       36.82
         19 |        885        1.74       38.56
         20 |      1,230        2.42       40.98
         21 |        859        1.69       42.67
         22 |        983        1.93       44.60
         23 |        805        1.58       46.18
         24 |        787        1.55       47.73
         25 |      1,129        2.22       49.95
         26 |        880        1.73       51.68
         27 |        704        1.38       53.06
         28 |        900        1.77       54.83
         29 |        582        1.14       55.97
         30 |      1,206        2.37       58.34
         31 |        582        1.14       59.49
         32 |        768        1.51       61.00
         33 |        493        0.97       61.97
         34 |        552        1.08       63.05
         35 |      1,235        2.43       65.48
         36 |        655        1.29       66.77
         37 |        484        0.95       67.72
         38 |        687        1.35       69.07
         39 |        422        0.83       69.90
         40 |      1,080        2.12       72.02
         41 |        442        0.87       72.89
         42 |        723        1.42       74.31
         43 |        416        0.82       75.13
         44 |        434        0.85       75.98
         45 |        852        1.67       77.66
         46 |        519        1.02       78.68
         47 |        397        0.78       79.46
         48 |        498        0.98       80.43
         49 |        325        0.64       81.07
         50 |        817        1.61       82.68
         51 |        478        0.94       83.62
         52 |        630        1.24       84.86
         53 |        387        0.76       85.62
         54 |        385        0.76       86.37
         55 |        667        1.31       87.69
         56 |        392        0.77       88.46
         57 |        311        0.61       89.07
         58 |        344        0.68       89.74
         59 |        256        0.50       90.25
         60 |        780        1.53       91.78
         61 |        300        0.59       92.37
         62 |        282        0.55       92.92
         63 |        257        0.51       93.43
         64 |        209        0.41       93.84
         65 |        467        0.92       94.76
         66 |        236        0.46       95.22
         67 |        186        0.37       95.59
         68 |        203        0.40       95.99
         69 |        223        0.44       96.42
         70 |        394        0.77       97.20
         71 |        117        0.23       97.43
         72 |        140        0.28       97.70
         73 |        103        0.20       97.91
         74 |         89        0.17       98.08
         75 |        193        0.38       98.46
         76 |         87        0.17       98.63
         77 |         55        0.11       98.74
         78 |         69        0.14       98.88
         79 |         41        0.08       98.96
         80 |        167        0.33       99.28
         81 |         52        0.10       99.39
         82 |         54        0.11       99.49
         83 |         25        0.05       99.54
         84 |         44        0.09       99.63
         85 |         53        0.10       99.73
         86 |         22        0.04       99.78
         87 |          9        0.02       99.79
         88 |         20        0.04       99.83
         89 |          6        0.01       99.84
         90 |         25        0.05       99.89
         91 |          6        0.01       99.91
         92 |          6        0.01       99.92
         93 |          6        0.01       99.93
         94 |          3        0.01       99.94
        95+ |         29        0.06       99.99
         DK |          3        0.01      100.00
    Missing |          1        0.00      100.00
------------+-----------------------------------
      Total |     50,876      100.00

. replace hh_id = hh1*1000 + hh2 if ln==0 //Creates hd_id for children 
> without household line, but this is not a problem //
(0 real changes made)

. drop _merge

. 
. erase "$workingfolder_out\npl14_CH.dta"

. 
. sort ind_id

. 
. *Merging BH Recode for Nepal
. merge 1:1 ind_id using "$workingfolder_out\npl14_BH.dta" ###matched

    Result                           # of obs.
    -----------------------------------------
    not matched                        46,577
        from master                    46,577  (_merge==1)
        from using                          0  (_merge==2)

    matched                             9,962  (_merge==3)
    -----------------------------------------

. ta cm1 if _m==1,m   //only those who have not given birth are not mer
> ged. ###matched

 Ever given |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      4,200        9.02        9.02
          . |     42,377       90.98      100.00
------------+-----------------------------------
      Total |     46,577      100.00

. drop _merge

. erase "$workingfolder_out\npl14_BH.dta"

. 
. *** MPI is based on de jure population only. 
. 
. *********************************************************************
> *******************************
. ** 1.6b Create control variables if household has ‘Eligible’ members 
> for WM and CH Levels **********
. *********************************************************************
> *******************************
. 
. //At this step we check if there is no female member eligible for the
>  interview, if there are no children to measure anthropometrics, ///
. //if there are no women to measure BMI (Body Mass Index). This is imp
> ortant because for those households we will have no info on some indi
> cators of health.//
. // We will consider these households as non-deprived in those particu
> lar indicators. For further details see Alkire and Santos (2010)//
. 
. ***Eligible Women for IR Recode***
. *Please make sure that hl7 has no missing values. 'fem_eligible' belo
> w should acknowledge 
. *that (hl7>0 & hl7<.) are fem_eligible
. gen     fem_eligible = (hl7>0) 

. bys hh_id: egen hh_n_fem_eligible = sum(fem_eligible) //Number of eli
> gible women for interview in the hh//

. gen no_fem_eligible = (hh_n_fem_eligible==0) //Takes value 1 if the h
> ousehold had no eligible females for an interview//

. label var no_fem_eligible "Household has no eligible women"

. 
. ***Eligible Men for MR Recode***
. /*No male recole in Nepal, Please active the following lines and chan
> ge them accordingly//
> *Please make sure that hl7a has no missing values. 'male_eligible' be
> low should acknowledge 
> *that (hl7a>0 & hl7a<.) are male_eligible
> gen male_eligible = (hl7a>0)
> bys hh_id: egen hh_n_male_eligible = sum(male_eligible)  //Number of 
> eligible men for interview in the hh//
> gen no_male_eligible = (hh_n_male_eligible==0) //Takes value 1 if the
>  household had no eligible males for an interview//
> label var no_male_eligible "Household has no eligible men"
> */
. ***Eligible Children anthropometrics*** 
. gen     child_eligible = (hl7b>0 | child_CH==1) //line number for mot
> her/caretake for children under five//

. bys     hh_id: egen hh_n_children_eligible = sum(child_eligible) //Nu
> mber of eligible children for anthropometrics//

. gen     no_child_eligible = (hh_n_children_eligible==0) //Takes value
>  1 if there were no eligible children for anthropometrics//

. lab var no_child_eligible "Household has no children eligible"

. 
. ***No eligible Children AND no eligible Women - it won't be used for 
> nutrition as only children have information on nutrition***
. gen     no_child_fem_eligible = (no_child_eligible==1 & no_fem_eligib
> le==1)

. lab var no_child_fem_eligible "Household has no children or women eli
> gible"

. 
. ***No eligible Women AND no eligible Men - Used for the applicable po
> pulation of Child mortality***
. *gen no_eligibles = (no_fem_eligible==1 & no_male_eligible==1 ) //Tak
> es value 1 if the household had no eligible members for an interview/
> /
. gen no_eligibles = (no_fem_eligible==1) //Takes value 1 if the househ
> old had no eligible members for an interview//

. lab var no_eligibles "Household has no eligible women"

. 
. *drop hh_n_fem_eligible child_eligible hh_n_children_eligible
. 
. bys hh_id: gen id = _n

. count if id==1
  12,405

. count
  56,539

. 
. *Please copy in the Country Survey Info file the results from below 
. * people
. count if no_eligible==1 
  4,483

. * households
. count if no_eligible==1  & id==1
  1,913

. 
. * people
. count if no_fem_eligible==1 
  4,483

. * households
. count if no_fem_eligible==1  & id==1
  1,913

. 
. /* people
> count if no_male_eligible==1 
> * households
> count if no_male_eligible ==1  & id==1
> */
. * people
. count if no_child_eligible==1 
  31,294

. * households
. count if no_child_eligible==1  & id==1
  8,059

. 
. * people
. count if no_child_fem_eligible==1 
  4,313

. * households
. count if no_child_fem_eligible==1  & id==1
  1,878

. *********************************************************************
> ************************************
. ******** Step 2: Data preparation ***********************************
> ***************************************
. ******** Standardization of the 10 indicators and identification of d
> eprived individuals **************************
. *********************************************************************
> ************************************
. 
. *** Rename basic variables 
. clonevar weight = hhweight  //Sample weight//

. 
. codebook hh6

-----------------------------------------------------------------------
hh6                                                                Area
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  HH6

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  0/56,539

            tabulation:  Freq.   Numeric  Label
                        12,141         1  Urban
                        44,398         2  Rural

. label list HH6
HH6:
           1 Urban
           2 Rural

. clonevar urban = hh6  //Type of place of residency: urban/rural//

. replace urban = 0 if urban == 2 //Redefine the coding and labels to 1
> /0//
(44,398 real changes made)

. label define lab_urban 1 "urban" 0 "rural"

. label values urban lab_urban

. 
. clonevar relationship = hl3  //Relationship to the head of household/
> / 

. 
. clonevar sex = hl4  //Sex household member//

. replace sex = 0 if sex==2 //Redefine the coding and labels to 1/0//
(29,556 real changes made)

. replace sex = . if sex==9 //No missing values
(0 real changes made)

. label define sex 1"male" 0 "female"

. label val sex sex

. 
. clonevar age = hl6 //Age household member//

. replace age = . if age==98 | age==99 // no missing values
(4 real changes made, 4 to missing)

. 
. //hhs should only include de jure members in the household. Most MICS
>  do not allow identifying usual residents, so we proceed as follows. 
> Please check whether your country has this information, and adjust th
> e following lines accordingly//
. sort hh_id

. by hh_id: gen temp = _n

. by hh_id: egen hhs = max(temp) 

. label var hhs "Household size"

. drop temp

. 
. /*p.3Nepal MICS was designed to provide estimates for a large number 
> of indicators
> on the situation of children and women at the national level, for urb
> an and rural areas, and for the
> following 15 sub-regions. The urban and rural areas within each sub-r
> egion were identified as the main sampling strata and the
> sample was selected in two stages. Within each stratum, a specified n
> umber of census enumeration
> areas were selected systematically with probability proportional to s
> ize...The sample included 520 clusters*/
. decode hh7, gen(temp)

. encode temp, gen(region)

. drop temp

. *********************************************************************
> *******************
. *** Step 2.1 Years of Schooling *************************************
> **********************
. *********************************************************************
> *******************
. //The entire household is considered deprived if no household member 
> has completed five years of schooling//
. 
. *** Renaming and recoding Education Variables
. //IMPORTANT: The coding of these variables in each country may differ
>  so you need to convert it to the coding listed below each variable w
> hen defining the label corresponding to that var. Here we follow the 
> same procedure as with housing characteristics//
. 
. *** MICS does not provide the number of years of education so we need
>  to construct that variable from the edulevel and eduhighyear variabl
> es created in what follows ***
. 
. *tab ed4b ed4a, miss   //ed4a does not exist in Nepal
. codebook ed4b, ta(30)

-----------------------------------------------------------------------
ed4b                                            Highest grade completed
-----------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  ED4B, but 11 nonmissing values are not labeled

                 range:  [0,99]                       units:  1
         unique values:  18                       missing .:  21,002/56
> ,539

            tabulation:  Freq.   Numeric  Label
                           508         0  
                         1,921         1  
                         2,472         2  
                         2,570         3  
                         2,545         4  
                         3,613         5  
                         2,262         6  
                         2,607         7  
                         2,759         8  
                         1,760         9  
                         2,272        10  
                         3,619        11  SLC
                         2,708        12  Plus 2 level
                           983        13  Bachelor
                           443        14  Masters
                         2,442        94  Preschool
                            22        98  DK
                            31        99  Missing
                        21,002         .  

. tab age ed6b if ed5==1, miss

           | Grade of education attending current school
           |                    year
       Age |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         5 |       359         82          9          1 |       922 
         6 |       491        217         84          7 |     1,185 
         7 |       365        448        224         51 |     1,296 
         8 |       208        405        384        150 |     1,328 
         9 |        97        193        335        296 |     1,127 
        10 |        65        173        340        408 |     1,582 
        11 |        22         80        147        208 |     1,177 
        12 |        14         46        107        180 |     1,504 
        13 |         8         12         36        106 |     1,348 
        14 |         1          8         12         47 |     1,347 
        15 |         0          4          7         21 |     1,048 
        16 |         0          2          1          5 |     1,061 
        17 |         0          0          0          2 |       781 
        18 |         0          0          0          1 |       871 
        19 |         0          0          0          0 |       453 
        20 |         0          0          0          0 |       513 
        21 |         0          0          0          0 |       334 
        22 |         1          0          0          1 |       271 
        23 |         0          0          0          0 |       221 
        24 |         0          0          0          0 |       150 
-----------+--------------------------------------------+----------
     Total |     1,631      1,670      1,686      1,484 |    18,519 


           | Grade of education attending current school
           |                    year
       Age |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
         5 |         0          0          0          0 |       922 
         6 |         0          0          1          0 |     1,185 
         7 |         3          2          0          0 |     1,296 
         8 |        72          9          2          0 |     1,328 
         9 |       137         27          4          1 |     1,127 
        10 |       341        166         56          6 |     1,582 
        11 |       313        251        119         23 |     1,177 
        12 |       293        399        292        145 |     1,504 
        13 |       153        269        346        267 |     1,348 
        14 |        92        185        250        357 |     1,347 
        15 |        27         59        137        240 |     1,048 
        16 |         9         41         91        160 |     1,061 
        17 |         8         15         21         52 |       781 
        18 |         3          5         25         46 |       871 
        19 |         4          2          2          7 |       453 
        20 |         0          4          2         11 |       513 
        21 |         1          0          1          3 |       334 
        22 |         0          1          0          4 |       271 
        23 |         0          2          0          1 |       221 
        24 |         1          0          0          1 |       150 
-----------+--------------------------------------------+----------
     Total |     1,457      1,437      1,349      1,324 |    18,519 


           | Grade of education attending current school
           |                    year
       Age |         9         10  Plus 2 le   Bachelor |     Total
-----------+--------------------------------------------+----------
         5 |         0          0          0          0 |       922 
         6 |         0          0          0          0 |     1,185 
         7 |         0          0          0          0 |     1,296 
         8 |         0          1          1          0 |     1,328 
         9 |         0          0          0          0 |     1,127 
        10 |         0          0          0          0 |     1,582 
        11 |         2          1          0          0 |     1,177 
        12 |        23          1          0          0 |     1,504 
        13 |       117         32          0          0 |     1,348 
        14 |       260        127          7          0 |     1,347 
        15 |       267        257         28          0 |     1,048 
        16 |       218        390        142          2 |     1,061 
        17 |       129        299        234         20 |       781 
        18 |        80        296        304        110 |       871 
        19 |        36        129        158        113 |       453 
        20 |        18        104        174        194 |       513 
        21 |         3         29        120        171 |       334 
        22 |         2         13         83        147 |       271 
        23 |         2          7         34        143 |       221 
        24 |         1          3         28         84 |       150 
-----------+--------------------------------------------+----------
     Total |     1,158      1,689      1,313        984 |    18,519 


           | Grade of education attending current school
           |                    year
       Age |   Masters  Preschool         DK    Missing |     Total
-----------+--------------------------------------------+----------
         5 |         0        463          8          0 |       922 
         6 |         0        381          4          0 |     1,185 
         7 |         0        201          0          2 |     1,296 
         8 |         0         96          0          0 |     1,328 
         9 |         0         37          0          0 |     1,127 
        10 |         0         26          1          0 |     1,582 
        11 |         0         11          0          0 |     1,177 
        12 |         0          4          0          0 |     1,504 
        13 |         0          2          0          0 |     1,348 
        14 |         0          0          0          1 |     1,347 
        15 |         0          1          0          0 |     1,048 
        16 |         0          0          0          0 |     1,061 
        17 |         0          0          1          0 |       781 
        18 |         1          0          0          0 |       871 
        19 |         0          0          1          1 |       453 
        20 |         4          0          1          1 |       513 
        21 |         5          0          1          0 |       334 
        22 |        16          0          2          1 |       271 
        23 |        31          0          1          0 |       221 
        24 |        32          0          0          0 |       150 
-----------+--------------------------------------------+----------
     Total |        89      1,222         20          6 |    18,519 

. 
. *Creating educational level variable
. //I create this by looking at the number of years assigned to the lev
> el of education of head of household
. ta ed4b helevel if relationship==1,m

     Highest |
       grade |         Education of household head
   completed |      None    Primary  Secondary     Higher |     Total
-------------+--------------------------------------------+----------
           0 |         0         29          0          0 |        29 
           1 |         0        107          0          0 |       107 
           2 |         0        363          0          0 |       363 
           3 |         0        530          0          0 |       530 
           4 |         0        450          0          0 |       450 
           5 |         0        958          0          0 |       958 
           6 |         0          0        368          0 |       368 
           7 |         0          0        508          0 |       508 
           8 |         0          0        609          0 |       609 
           9 |         0          0        359          0 |       359 
          10 |         0          0        578          0 |       578 
         SLC |         0          0          0        959 |       959 
Plus 2 level |         0          0          0        720 |       720 
    Bachelor |         0          0          0        360 |       360 
     Masters |         0          0          0        210 |       210 
   Preschool |         0          4          0          0 |         4 
          DK |         0          0          0          0 |        12 
     Missing |         0          0          0          0 |        14 
           . |     5,267          0          0          0 |     5,267 
-------------+--------------------------------------------+----------
       Total |     5,267      2,441      2,422      2,249 |    12,405 


             | Education
             |     of
     Highest | household
       grade |    head
   completed | Missing/D |     Total
-------------+-----------+----------
           0 |         0 |        29 
           1 |         0 |       107 
           2 |         0 |       363 
           3 |         0 |       530 
           4 |         0 |       450 
           5 |         0 |       958 
           6 |         0 |       368 
           7 |         0 |       508 
           8 |         0 |       609 
           9 |         0 |       359 
          10 |         0 |       578 
         SLC |         0 |       959 
Plus 2 level |         0 |       720 
    Bachelor |         0 |       360 
     Masters |         0 |       210 
   Preschool |         0 |         4 
          DK |        12 |        12 
     Missing |        14 |        14 
           . |         0 |     5,267 
-------------+-----------+----------
       Total |        26 |    12,405 

. 
. gen     edulevel = . //Highest educational level attended//
(56,539 missing values generated)

. replace edulevel = . if ed4b==. | ed4b==98 | ed4b==99  //These are al
> l missing values, (nsp: ne se pronunce pa and manquant: missing) chec
> k that that is also the case in your data//
(0 real changes made)

. replace edulevel = 0 if ed3==2 //Never attended school//
(15,236 real changes made)

. replace edulevel = 1 if ed4b>=0 & ed4b<=5 // Replacing higher educati
> on when the person has university or post university degree
(13,629 real changes made)

. replace edulevel = 2 if ed4b>=6 & ed4b<=10
(11,660 real changes made)

. replace edulevel = 3 if ed4b>=11 & ed4b<=14
(7,753 real changes made)

. replace edulevel = 0 if ed4b==94   //Preschool is treated as primary 
> for the head of household, but in other countries we treat it as no e
> ducation. Hence, it is treated as no education in here.
(2,442 real changes made)

. label   define lab_edulevel 0 "None" 1 "Primary" 2 "Secondary" 3"High
> er", replace

. label   values edulevel lab_edulevel 

. label   var    edulevel "Highest educational level attended"

. ta ed4b edulevel ,m nol

   Highest |
     grade |     Highest educational level attended
 completed |         0          1          2          3 |     Total
-----------+--------------------------------------------+----------
         0 |         0        508          0          0 |       508 
         1 |         0      1,921          0          0 |     1,921 
         2 |         0      2,472          0          0 |     2,472 
         3 |         0      2,570          0          0 |     2,570 
         4 |         0      2,545          0          0 |     2,545 
         5 |         0      3,613          0          0 |     3,613 
         6 |         0          0      2,262          0 |     2,262 
         7 |         0          0      2,607          0 |     2,607 
         8 |         0          0      2,759          0 |     2,759 
         9 |         0          0      1,760          0 |     1,760 
        10 |         0          0      2,272          0 |     2,272 
        11 |         0          0          0      3,619 |     3,619 
        12 |         0          0          0      2,708 |     2,708 
        13 |         0          0          0        983 |       983 
        14 |         0          0          0        443 |       443 
        94 |     2,442          0          0          0 |     2,442 
        98 |         0          0          0          0 |        22 
        99 |         0          0          0          0 |        31 
         . |    15,236          0          0          0 |    21,002 
-----------+--------------------------------------------+----------
     Total |    17,678     13,629     11,660      7,753 |    56,539 


           |  Highest
           | educationa
   Highest |  l level
     grade |  attended
 completed |         . |     Total
-----------+-----------+----------
         0 |         0 |       508 
         1 |         0 |     1,921 
         2 |         0 |     2,472 
         3 |         0 |     2,570 
         4 |         0 |     2,545 
         5 |         0 |     3,613 
         6 |         0 |     2,262 
         7 |         0 |     2,607 
         8 |         0 |     2,759 
         9 |         0 |     1,760 
        10 |         0 |     2,272 
        11 |         0 |     3,619 
        12 |         0 |     2,708 
        13 |         0 |       983 
        14 |         0 |       443 
        94 |         0 |     2,442 
        98 |        22 |        22 
        99 |        31 |        31 
         . |     5,766 |    21,002 
-----------+-----------+----------
     Total |     5,819 |    56,539 

. ta ed3 edulevel if ed4b==. ,m  //some are missing values, some are ne
> ver attended school

      Ever |
  attended |  Highest educational
 school or |    level attended
pre-school |      None          . |     Total
-----------+----------------------+----------
        No |    15,236          0 |    15,236 
   Missing |         0        103 |       103 
         . |         0      5,663 |     5,663 
-----------+----------------------+----------
     Total |    15,236      5,766 |    21,002 

. 
. gen     eduhighyear = ed4b //Highest grade of education completed//
(21,002 missing values generated)

. replace eduhighyear = .  if ed4b==. | ed4b==98 | ed4b==99 //These are
>  all missing values, check that that is also the case in your data//
(53 real changes made, 53 to missing)

. replace eduhighyear = 0  if ed3==2 //Never attended school//
(15,236 real changes made)

. replace eduhighyear = 0  if ed4b==94   //Preschool is treated as prim
> ary for the head of household, but in other countries we treat it as 
> no education. Hence, it is treated as no education in here.
(2,442 real changes made)

. 
. lab var eduhighyear "Highest year of education completed"

. tab eduhighyear edulevel, m

   Highest |
   year of |
 education |     Highest educational level attended
 completed |      None    Primary  Secondary     Higher |     Total
-----------+--------------------------------------------+----------
         0 |    17,678        508          0          0 |    18,186 
         1 |         0      1,921          0          0 |     1,921 
         2 |         0      2,472          0          0 |     2,472 
         3 |         0      2,570          0          0 |     2,570 
         4 |         0      2,545          0          0 |     2,545 
         5 |         0      3,613          0          0 |     3,613 
         6 |         0          0      2,262          0 |     2,262 
         7 |         0          0      2,607          0 |     2,607 
         8 |         0          0      2,759          0 |     2,759 
         9 |         0          0      1,760          0 |     1,760 
        10 |         0          0      2,272          0 |     2,272 
        11 |         0          0          0      3,619 |     3,619 
        12 |         0          0          0      2,708 |     2,708 
        13 |         0          0          0        983 |       983 
        14 |         0          0          0        443 |       443 
         . |         0          0          0          0 |     5,819 
-----------+--------------------------------------------+----------
     Total |    17,678     13,629     11,660      7,753 |    56,539 


           |  Highest
   Highest | educationa
   year of |  l level
 education |  attended
 completed |         . |     Total
-----------+-----------+----------
         0 |         0 |    18,186 
         1 |         0 |     1,921 
         2 |         0 |     2,472 
         3 |         0 |     2,570 
         4 |         0 |     2,545 
         5 |         0 |     3,613 
         6 |         0 |     2,262 
         7 |         0 |     2,607 
         8 |         0 |     2,759 
         9 |         0 |     1,760 
        10 |         0 |     2,272 
        11 |         0 |     3,619 
        12 |         0 |     2,708 
        13 |         0 |       983 
        14 |         0 |       443 
         . |     5,819 |     5,819 
-----------+-----------+----------
     Total |     5,819 |    56,539 

. 
. ** Cleaning inconsistencies
. replace eduhighyear = 0 if age<10 //Based on UNDP agreed bottom age t
> hreshold 
(8,859 real changes made)

. replace eduhighyear = . if edulevel==1 & eduhighyear>5 // According t
> o the report (page 166) Primary school is until 8th grade 
(0 real changes made)

. replace eduhighyear = . if edulevel==2 & eduhighyear>10
(0 real changes made)

. replace eduhighyear = . if edulevel==3 & eduhighyear>14   // secondar
> y education covers 8grades of education 
(0 real changes made)

. replace eduhighyear = 0 if edulevel==0
(0 real changes made)

. 
. ** Now we create the years of schooling
. gen     eduyears = eduhighyear
(125 missing values generated)

. *I won't need to adjust this as the variable comes as continuous year
> s of education originally, higher education may assume continues year
> s but this does not affect poverty.
. 
. ** Checking for further inconsistencies
. //There are some cases in which the years of schooling are greater th
> an the age of the individual, which is clearly a mistake in the data.
>  There might also be individuals that show too much schooling given t
> heir age (e.g. a 7 year-old with 5 years of schooling). Please check 
> whether this is the case in your country and correct when necessary//
. replace eduyears = . if age<=eduyears & age>0
(0 real changes made)

. replace eduyears = 0 if age<10  //agreed with UNDP. 39 cases of child
> ren with 5 years of education are not considered as they are younger 
> than 10 years old (7,8&9).
(0 real changes made)

. lab var eduyears "Total number of years of education accomplished"

. 
. ta eduyear eduhighyear,m

     Total |
 number of |
  years of |
 education |
accomplish |     Highest year of education completed
        ed |         0          1          2          3 |     Total
-----------+--------------------------------------------+----------
         0 |    27,045          0          0          0 |    27,045 
         1 |         0        570          0          0 |       570 
         2 |         0          0      1,432          0 |     1,432 
         3 |         0          0          0      2,061 |     2,061 
         4 |         0          0          0          0 |     2,330 
         5 |         0          0          0          0 |     3,574 
         6 |         0          0          0          0 |     2,255 
         7 |         0          0          0          0 |     2,605 
         8 |         0          0          0          0 |     2,759 
         9 |         0          0          0          0 |     1,759 
        10 |         0          0          0          0 |     2,272 
        11 |         0          0          0          0 |     3,618 
        12 |         0          0          0          0 |     2,708 
        13 |         0          0          0          0 |       983 
        14 |         0          0          0          0 |       443 
         . |         0          0          0          0 |       125 
-----------+--------------------------------------------+----------
     Total |    27,045        570      1,432      2,061 |    56,539 


     Total |
 number of |
  years of |
 education |
accomplish |     Highest year of education completed
        ed |         4          5          6          7 |     Total
-----------+--------------------------------------------+----------
         0 |         0          0          0          0 |    27,045 
         1 |         0          0          0          0 |       570 
         2 |         0          0          0          0 |     1,432 
         3 |         0          0          0          0 |     2,061 
         4 |     2,330          0          0          0 |     2,330 
         5 |         0      3,574          0          0 |     3,574 
         6 |         0          0      2,255          0 |     2,255 
         7 |         0          0          0      2,605 |     2,605 
         8 |         0          0          0          0 |     2,759 
         9 |         0          0          0          0 |     1,759 
        10 |         0          0          0          0 |     2,272 
        11 |         0          0          0          0 |     3,618 
        12 |         0          0          0          0 |     2,708 
        13 |         0          0          0          0 |       983 
        14 |         0          0          0          0 |       443 
         . |         0          0          0          0 |       125 
-----------+--------------------------------------------+----------
     Total |     2,330      3,574      2,255      2,605 |    56,539 


     Total |
 number of |
  years of |
 education |
accomplish |     Highest year of education completed
        ed |         8          9         10         11 |     Total
-----------+--------------------------------------------+----------
         0 |         0          0          0          0 |    27,045 
         1 |         0          0          0          0 |       570 
         2 |         0          0          0          0 |     1,432 
         3 |         0          0          0          0 |     2,061 
         4 |         0          0          0          0 |     2,330 
         5 |         0          0          0          0 |     3,574 
         6 |         0          0          0          0 |     2,255 
         7 |         0          0          0          0 |     2,605 
         8 |     2,759          0          0          0 |     2,759 
         9 |         0      1,759          0          0 |     1,759 
        10 |         0          0      2,272          0 |     2,272 
        11 |         0          0          0      3,618 |     3,618 
        12 |         0          0          0          0 |     2,708 
        13 |         0          0          0          0 |       983 
        14 |         0          0          0          0 |       443 
         . |         0          0          0          0 |       125 
-----------+--------------------------------------------+----------
     Total |     2,759      1,759      2,272      3,618 |    56,539 


     Total |
 number of |
  years of |
 education |
accomplish |     Highest year of education completed
        ed |        12         13         14          . |     Total
-----------+--------------------------------------------+----------
         0 |         0          0          0          0 |    27,045 
         1 |         0          0          0          0 |       570 
         2 |         0          0          0          0 |     1,432 
         3 |         0          0          0          0 |     2,061 
         4 |         0          0          0          0 |     2,330 
         5 |         0          0          0          0 |     3,574 
         6 |         0          0          0          0 |     2,255 
         7 |         0          0          0          0 |     2,605 
         8 |         0          0          0          0 |     2,759 
         9 |         0          0          0          0 |     1,759 
        10 |         0          0          0          0 |     2,272 
        11 |         0          0          0          0 |     3,618 
        12 |     2,708          0          0          0 |     2,708 
        13 |         0        983          0          0 |       983 
        14 |         0          0        443          0 |       443 
         . |         0          0          0        125 |       125 
-----------+--------------------------------------------+----------
     Total |     2,708        983        443        125 |    56,539 

. 
. gen     years_edu5 = (eduyears>=5)

. replace years_edu5 = . if eduyears==.
(125 real changes made, 125 to missing)

. 
. 
. //Following a control variable is created on whether there is informa
> tion on years of education for at least 2/3 of the household members 
> – this is the no_missing_edu variable//
. gen     temp = (eduyears~=.)

. bys     hh_id: egen no_missing_edu = sum(temp)

. by hh_id: gen temp2 = sum(age>10 & age!=.)

. by hh_id: egen hhs2 = max(temp2) 

. label var hhs2 "Household size aged 10 or older"

. replace no_missing_edu = no_missing_edu/hhs2
(54,484 real changes made)

. replace no_missing_edu = (no_missing_edu>=2/3)
(40,198 real changes made)

. drop    temp temp2

. 
. bys     hh_id: egen hh_years_edu5 = max(years_edu5)
(3 missing values generated)

. replace hh_years_edu5 = . if hh_years_edu5==0 & no_missing_edu==0
(8 real changes made, 8 to missing)

. replace hh_years_edu5 = . if hh_id==. //we exclude non-usual resident
> s//
(0 real changes made)

. //The final variable is missing if the household has less than 2/3 of
>  members with info on years and for the ones for which it has info, i
> t is less than 5 years//
. lab var hh_years_edu5 "Household has at least one member with 5 years
>  of edu"

. 
. *** The indicator: it takes value 1 if at least someone in the hh has
>  reported 5 years of edu or more, and 0 if for those hh for which at 
> least 2/3 of the members reported years, no one has 5 years or more. 
> The indicator has a missing value when there is missing info on years
>  of edu for 2/3 or more of the hh members with no one reporting 5 yea
> rs of education, or when all household members have missing informati
> on on years of education.
. 
. *** Ultrapoverty indicator: nobody completed at least 1 year of schoo
> ling
. gen     years_edu1 = (eduyears>=1)

. replace years_edu1 = . if eduyears==.
(125 real changes made, 125 to missing)

. 
. bys     hh_id: egen hh_years_edu1 = max(years_edu1)
(3 missing values generated)

. replace hh_years_edu1 = . if hh_years_edu1==0 & no_missing_edu==0
(8 real changes made, 8 to missing)

. replace hh_years_edu1 = . if hh_id==. //we exclude non-usual resident
> s//
(0 real changes made)

. lab var hh_years_edu1 "Household has at least one member with 1 year 
> of edu"

. 
. *********************************************************************
> *******************
. *** Step 2.2 Child School Attendance  *******************************
> **********************
. *********************************************************************
> *******************
. //The entire household is considered deprived if any school-aged chil
> d is not attending school up to class 8. Data Source for age children
>  start school: United Nations Educational, Scientific and Cultural Or
> ganization, Institute for Statistics database, Table 1. Education sys
> tems [UIS, http://stats.uis.unesco.org/unesco/TableViewer/tableView.a
> spx?ReportId=163 ]//
. 
. //Note that MICS may have more than one variable for school attendanc
> e. Use the corresponding line below, according to the variable you ha
> ve. Please check that it corresponds 1=attending, 0=not attending//
. *Ed5 questions about formal school
. gen     attendance = .
(56,539 missing values generated)

. replace attendance = 0 if ed5==2 //Not currently attending//
(3,984 real changes made)

. replace attendance = 1 if ed5==1 //Currently attending//
(18,519 real changes made)

. replace attendance = . if age<5 | age>24 | ed5==. | ed5==9
(0 real changes made)

. replace attendance = 0 if ed3==2 //Never attended//
(15,236 real changes made)

. 
. //IMPORTANT: Please change the age range according to the compulsory 
> schooling age of the particular country. You will need to check this 
> in http://stats.uis.unesco.org/unesco/TableViewer/tableView.aspx?Repo
> rtId=163. Look at the starting age and add 8 (regardless of the final
> izing compulsory age in the country. So for example, if the compulsor
> y age is 5-11 years, your age range will be 5-13 (=5+8) years.//
. ///p.12 table HH5 reports attendance from 5. UIS reporst 5 as the sta
> rting school age for primary, the dataset reporst attendance from 5. 
> I decided to take 5 as starting school age.
> gen child_schoolage = (age>=5 & age<=13) // According to the informat
> ion in the report, it coincides with UNESCO UIS

. bys hh_id: egen hh_children_schoolage = sum(child_schoolage)

. replace hh_children_schoolage = (hh_children_schoolage>0) //Control v
> ariable: It takes value 1 if the household has children in school age
> //
(22,751 real changes made)

. 
. gen child_not_atten = (attendance==0) if child_schoolage==1
(44,276 missing values generated)

. replace child_not_atten = . if attendance==. & child_schoolage==1
(43 real changes made, 43 to missing)

. bys hh_id: egen any_child_not_atten = max(child_not_atten)
(19217 missing values generated)

. gen hh_all_child_atten = (any_child_not_atten==0) 

. replace hh_all_child_atten = . if any_child_not_atten==.
(19,217 real changes made, 19,217 to missing)

. replace hh_all_child_atten = 1 if hh_children_schoolage==0
(19,128 real changes made)

. tab hh_all_child_atten

hh_all_chil |
    d_atten |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,030        7.14        7.14
          1 |     52,420       92.86      100.00
------------+-----------------------------------
      Total |     56,450      100.00

. 
. //The indicator takes value 1 if ALL children in school age are atten
> ding school and 0 if there is at least one child not attending.  Hous
> eholds with no children receive a value of 1 as non-deprived.  The in
> dicator has a missing value only when there are all missing values on
>  children attendance in households that have children in school age. 
> Please create a missing variable only if ed4 is all missing//
. *gen hh_all_child_atten=.
. label var hh_children_schoolage "Household has children in school age
> "

. label var hh_all_child_atten "Household has all school age children i
> n school"

. 
. * Ultrapoverty indicator
. gen     child_schoolage_6 = (age>=5 & age<=11) 

. bys     hh_id: egen hh_children_schoolage_6 = sum(child_schoolage_6)

. replace hh_children_schoolage_6 = (hh_children_schoolage_6>0) 
(16,650 real changes made)

. lab var hh_children_schoolage_6 "Household has children in school age
>  (6 years of school)"

. 
. gen     child_atten_6 = (attendance==1) if child_schoolage_6==1
(47,282 missing values generated)

. replace child_atten_6 = . if attendance==. & child_schoolage_6==1
(37 real changes made, 37 to missing)

. bys     hh_id: egen any_child_atten_6 = max(child_atten_6)
(23669 missing values generated)

. gen     hh_all_child_atten_6 = (any_child_atten_6==1) 

. replace hh_all_child_atten_6 = . if any_child_atten_6==.
(23,669 real changes made, 23,669 to missing)

. replace hh_all_child_atten_6 = 1 if hh_children_schoolage_6==0
(23,593 real changes made)

. lab var hh_all_child_atten_6 "Household has at least one school age c
> hildren (6 years of school) in school"

. 
. **********************
. *** Step 2.3 Nutrition
. **********************
. //The entire household is considered deprived if any adult or child f
> or whom there is nutritional information is malnourished in the house
> hold. Adults are considered undernourished if their BMI is below 18.5
>  m/kg2. Children are considered malnourished if their z-score of weig
> ht-for-age is below minus two standard deviations from the median of 
> the reference population. Alternative estimations were performed usin
> g stunting and wasting. For further details please see Alkire and San
> tos (2010).//
. 
. *** Low BMI of mother or daughter
. //The BMI of the mother/daughter is not captured in Nepal MICS 2014
. gen hh_no_low_bmi = .
(56,539 missing values generated) #### match

. gen f_low_bmi = .
(56,539 missing values generated)  #### match

. gen m_low_bmi = .
(56,539 missing values generated) #### match

. 
. *** Household Child Undernutrition Dummy ***
. //Households with no eligible children to be measured will receive a 
> value of 1//
. bys     hh_id: egen temp = max(underwa2)
(32872 missing values generated)

. gen     hh_no_underwa2 = (temp==0) //Takes value 1 if no child in the
>  hh is underweighted, 0 if at least one is//

. replace hh_no_underwa2 = . if temp==.
(32,872 real changes made, 32,872 to missing)

. drop temp

. lab var hh_no_underwa2 "Household has no child under weight-for-age –
>  2 stdev"

. 
. ***Now we replace the children nutrition indicators with 1 for the ho
> useholds that had no children eligible***
. replace hh_no_underwa2 = 1 if no_child_eligible==1 
(31,294 real changes made)

. 
. //NOTE that hh_no_underwh2 takes value 1 if: (a) no any eligible chil
> dren in the hh is undernourished or (b) there are no eligible childre
> n in the hh. The variable takes values 0 for those households that ha
> ve at least one measured child undernourished. The variable has missi
> ng values only when there is missing info in nutrition for ALL eligib
> le children in the household//
. 
. * Ultrapoverty indicator
. bys     hh_id: egen temp = max(underwa3)
(32872 missing values generated)

. gen     hh_no_underwa3 = (temp==0) //Takes value 1 if no child in the
>  hh is underweighted, 0 if at least one is//

. replace hh_no_underwa3 = . if temp==.
(32,872 real changes made, 32,872 to missing)

. replace hh_no_underwa3 = 1 if no_child_eligible==1 
(31,294 real changes made)

. lab var hh_no_underwa3 "Household has no child under weight-for-age -
>  3 stdev"

. drop temp

. 
. ****Finally we create the nutrition indicator to be used in the MPI: 
> hh_nutrition
. //The indicator takes value 1 if there is no undernourished adult or 
> children. It also takes value 1 for the households that had no eligib
> le women AND no eligible children. The indicator takes value 0 if any
>  adult or child for whom there is nutritional information is undernou
> rished in the household. The indicator takes value missing “.” only i
> f all eligible women and eligible children have missing information i
> n their respective nutrition variable. If the nutritional variable is
>  missing altogether in the dataset, this indicator will not be includ
> ed in the MPI and the mortality indicator will receive the full healt
> h weight//
. 
. gen hh_nutrition = hh_no_underwa2
(1,578 missing values generated)

. 
. //If your nutritional variable has observations only in the children 
> nutrition variable (as happens in all MICS as far as we know), label 
> as//
. label var hh_nutrition "Household has no child undernourished (weight
> -for-age)"

. 
. * Replacement for household without eligible children
. //The indicator takes value 1 for the households that had no eligible
>  children.// 
. 
. replace hh_nutrition = 1 if no_child_eligible==1 
(0 real changes made)

. 
. //If there is no nutritional information, then we create an empty var
> iable//
. *gen hh_nutrition=.
. 
. * Ultrapoverty indicator
. gen     hh_nutrition_3_17 = hh_no_underwa3
(1,578 missing values generated)

. replace hh_nutrition_3_17 = 1 if no_child_eligible==1 
(0 real changes made)

. lab var hh_nutrition_3_17 "Household has no child undernourished (wei
> ght-for-age)"

. 
. su hh_nutrition hh_nutrition_3_17  

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_nutrition |     54,961    .8448172    .3620821          0          1
hh_nutrit~17 |     54,961    .9500191    .2179075          0          1

. 
. log close
      name:  <unnamed>
       log:  C:\Users\oldig\Nextcloud\vietnam\Nepal\Nepal 2014 MICS_Dat
> asets\nepal_nutri_check.log
  log type:  text
 closed on:  12 Jul 2020, 22:32:44
-----------------------------------------------------------------------
